[
    {
        "id": "1009102270932119438",
        "timestamp": "12 Dec, 2013",
        "link": "http://store.steampowered.com/news/12084/",
        "entry": "\r\n\t\tRelease Notes for 12/12/2013[UI]- To improve chat readability, chat text colors have been updated to make the team, location and \"say\" text all use unique colors.[COMMUNITY]- Fixed exploits where custom maps could run non-whitelisted server commands.- Added functions for VScript to ask gamerules what game mode and type the current match is set to.[MISC]- Fixed an exploit where player's could print chat text on behalf of the console.- Fixed grenades making continuous noise when thrown into narrow spaces.\t\t\n"
    },
    {
        "id": "1027115944931846962",
        "timestamp": "4 Dec, 2013",
        "link": "http://store.steampowered.com/news/11998/",
        "entry": "\r\n\t\tClient update for 12/4/2013[MISC]- Fixed a problem with stickers on ATI GPUs.- Fixed tooltip positioning for items at the edge of the screen.- Fixed a rare case where clients could get stuck in the competitive search queue when Steam servers were experiencing heavy load.\t\t\n"
    },
    {
        "id": "1027114673592971459",
        "timestamp": "21 Nov, 2013",
        "link": "http://store.steampowered.com/news/11933/",
        "entry": "\r\n\t\tRelease Notes for 11/21/2013[MISC]- Added the Highlights feature. Players can view their own highlights from downloaded matches by selecting ‘Watch Your Highlights’ when clicking on a match. Other players’ highlights can be accessed through the match scoreboard.[ COMMUNITY ]- Graphs are now accessible when sv_competitive_official_5v5 is set to 1- Removed player number restriction from Spectator Stat chart.\t\t\n"
    },
    {
        "id": "1027114673548152817",
        "timestamp": "20 Nov, 2013",
        "link": "http://store.steampowered.com/news/11916/",
        "entry": "\r\n\t\tRelease Notes for 11/20/2013[MISC]- Added DreamHack 2013 tab in watch panel. This is the hud to watch and download all the games.- Added a panel to the spectator UI that shows the event logo, spectator number and viewer item drops during freeze time of an event.- Added a convar sv_matchpause_auto_5v5, when enabled will track if less than 5 human players are connected on either team and will pause match during nearest freezetime, and will automatically unpause when all 5 players are connected on both teams.- Spectators of competitive games can now access their inventory.- Fixed ADR showing the value from the previous half on round 1 of the second half.- Fixed case where a data series could exceed the chart range.- Grenade collision with doors is not affected when the grenade kills a chicken.- Players can no longer throw weapons through displacement surfaces.\t\t\n"
    },
    {
        "id": "1027114127719163972",
        "timestamp": "15 Nov, 2013",
        "link": "http://store.steampowered.com/news/11877/",
        "entry": "\r\n\t\tRelease Notes for 11/15/2013[GAMEPLAY]- Reduced fade to black time to 0.3s to better hide enemy movement when playing with \"mp_forcecamera 2\".- Buy Time now lasts the entire Warmup period.- Fixed the Defuse Kit making a pickup sound that everyone could hear when walking over it.- In official competitive mode players now accumulate end of round money even if they are disconnected at the moment when end of round money is awarded to their teammates.- In official competitive mode players who disconnect from the game server while alive are treated as having committed suicide and don't receive end of round money for that round.[MAPS]- Mirage improvements based on pro feedback-- Raised skybox ceiling around T spawn-- Rebuilt red building in T spawn to give more room for grenade throws-- Fixed a bug where Ts could see into Bombsite A without exposing themselves-- Added collision on tall box near CT stairs to prevent players getting onto it-- Fixed a bug where a player could get onto boxes near ladder room alone-- Added wider cover in mid, T side-- Made CT sniper window in mid taller-- Removed gaps where players could see through scaffolding in Bombsite A-- Fixed various spots where you could see through crates in Bombsite A-- Made it possible to shoot through a crate in Bombsite A-- Smoothed out movement inside Palace-- Added wider windows in Bombsite B apartment-- Fixed a bug where a player could stand on the wall outside B apartment-- Removed dark door underneath Bombsite B apartment-- Added pretty flowers- Nuke-- Fixed invisible I-beam collision in hut/lobby- Inferno-- Made railings on balcony near Bombsite A and CT spawn easier to see through[UI]- Fixed the overhead Freeze Time icons not updating frequently enough to catch certain equipment changes.- Fixed the Freeze/Invuln Time color correction being wrong if the Invuln Time was shorter than the Freeze Time length.- Fixed Achievement icons not appearing when it displayed Achievements earned in the previous round.- Fixed map selection button becoming inactive when Workshop maps are being updated.- Added Inventory error message when Steam cannot access your items.- Added item image to Delete Item confirmation.- Contracts-- Fixed not auto-scrolling away from a blank item list.-- Fixed being able to submit without signing.-- Fixed signatures being offset from the mouse cursor.[SPECTATING]- Reduced duration of red player damage effect.- In GOTV the kill camera now orients so both the killer and victim are visible.- Fixed spectator navtext no longer wrapping.[DEMOS]- Work in progress improvements to demoui & demoplayer:-- Menus, Overview Map, Graphs, etc. now work when the demo is paused.-- Improved seeking with less particle effect, sound, and HUD spew.-- Demo Timescale slider now goes up to 10x.-- Added buttons to directly set demo timescale to 1/4x, 1/2x, 1x, 2x, 4x speeds.-- Fixed Stats Graph round columns not resetting correctly when rewinding a demo.-- Removed demoui2.- Fixed color of weapon names not matching the actual rarity of the weapon.[COMMUNITY]- Added server convar sv_matchend_drops_enabled for suppressing item drops at the end of tournament matches, play time is still accumulated by players and items will be awarded at the next opportunity.- Using the game_round_end to force a specific winner now consistently increments the round number (you must still use the game_score entity to set the appropriate team score).- Fixed a case where CT coaches would get locked into 3rd person.[MISC]- Cached inventory icons are regenerated if Texture/Shader Detail is increased using the Options menu.[LINUX DEDICATED SERVERS]- Updated the version of libstdc++.so.6 for Linux dedicated servers to require Glibc 2.11.- Linux dedicated servers now upload core dumps out-of-process and more reliably.\t\t\n"
    },
    {
        "id": "1027113495007505804",
        "timestamp": "6 Nov, 2013",
        "link": "http://store.steampowered.com/news/11806/",
        "entry": "\r\n\t\tRelease Notes for 11/6/2013[GAMEPLAY]- Changed C4 planting sounds based on pro feedback. When planting the bomb, it plays an initialization sound that everyone can hear, but ONLY the player planting will hear the code typing sounds. This makes fake planting possible (similar to fake diffusing as a CT).- All items now follow the same pick up sound rules (grenades, C4, weapons, defuse kits, etc):-- If a player picks up an item while running, it plays a pickup sound that everyone can hear.-- If a player picks up an item while moving silently, it plays a subtle pickup sound to ONLY the player picking it up.- Weapons, grenades, and remaining money are now displayed as icons above player heads during freezetime. (Thanks R-arcHoniC)- Fixed overhead teammate arrows not showing up in some cases.- Fixed automatic observer target selection failing to find a controllable bot when a player was killed.[MAPS]- Cache: -- Fixed lighting on prop in CT spawn.-- Fixed buggy wallbangs at A main and B halls.-- Fixed issue with dropping bomb behind spools in mid warehouse.- Mirage: -- Increased size of Bombsite A plant area.-- Opened up skybox in T spawn.-- Improvements to visibility throughout the map. (Thanks andzie!)-- General optimizations.-- Smoothed out movement in Bombsite B.[UI]- Added ability to link your Steam account to Twitch.tv account.- Added Link to Twitch.tv button in Watch tab.- Added more stats to the Spectator Graphs: Average Damage per Round, Headshot Percentage, Total Cash Earned. - Fixed uncased knives with no finish displaying incorrectly in the GOTV and Demo UI.- Fixed spectator weapon panel staying visible when switching to Roam camera.- Fixed player panel appearing behind graphs.[DEMOS]- Work in progress improvements to demoui & demoplayer:-- Seeking backward no longer reloads the map.-- Can now seek to next/previous round start or player death.[COMMUNITY]- Fixed x-ray rules for coaches.- Players can now become coaches during freezetime in addition to warmup.\t\t\n"
    },
    {
        "id": "1045127258735408459",
        "timestamp": "30 Oct, 2013",
        "link": "http://store.steampowered.com/news/11753/",
        "entry": "\r\n\t\tRelease Notes for 10/30/2013[SPECTATING]- Spectating and dead players can now view a series of graphs displaying player/team statistics over time. Graphs are bound to lastinv (q, by default).- Fixed Avatars being overly bright for the selected player.- When a player is damaged, their outline is filled with a flashing red 'damage amount' indicator.[MAPS]- Adjusted the de_nuke B site particles a bit to make it sort correctly with smoke grenade smoke.[ COMMUNITY SERVERS ]- Added experimental support for coaches, which are effectively permanently dead teammates. To enable, set sv_coaching_enabled 1. To coach a team, type either 'coach t' or 'coach ct'.- Added concommands mp_pause_match and mp_unpause_match which will flag the match to pause indefinitely during freeze time and cancel the pause, respectively.[MISC]- Added detection of the case when a client downloads the latest version of a game update and becomes unable to reconnect to their ongoing competitive match on an older game server version. Minimal competitive matchmaking cooldowns will be assigned in this case, and will not increment client's competitive offense level.- Added server convar sv_force_transmit_players to allow networking player entities to all clients.- Money of dead players will now more reliably network to teammates at round end instead of waiting until round restart.- Fixed item icon cache retaining cached icons for items that you no longer own. Should reduce disk usage significantly for frequent traders.- Fixed the death notice text sometimes getting truncated (and skipping the victim names).- Fixed two hardcoded UI elements - they now properly use localized tokens.\t\t\n"
    },
    {
        "id": "1171227321005633991",
        "timestamp": "23 Oct, 2013",
        "link": "http://store.steampowered.com/news/11688/",
        "entry": "\r\n\t\tRelease Notes for 10/23/2013[GAMEPLAY]- Added eye shielding animation to players blinded by flashbangs.- Fixed respawning in Deathmatch sometimes choosing a spawn point visible to players when more ideal positions were available.- Fixed a bug in Deathmatch that could create weapons on the ground if a player spammed his \"buy\" key immediately upon respawn.[SPECTATING]- Added changeable, preset camera positions for all shipped maps that are activated by selecting a player with SHIFT + 0-9 while spectating. (see https://developer.valvesoftware.com/wiki/CSGO:_Spectator_Tools for more info)- Target players now glow white when viewing from a spectator camera in ROAMING mode.- When spectating in ROAMING mode, we now draw a subtle Aiming Vector Line that shows each player’s aiming direction.- Dropped C4 now glows for spectators (yellow = dropped, flashing red = planted, green = defused).- Added more UI during freeze time to display player money, spent money that round, and kills/assists/deaths.- Improved armor icons in spectator panels.- Fixed recoil not being applied in GOTV and replays.- Fixed UI weapon image sometimes being blank in GOTV.- StatTrak now displays correct number of kills in GOTV and replays.- Reenabled the spec_goto command and fixed it not working properly if called from a key bind.- Moved the autodirector toggle key from “+speed” to “radio3” (from SHIFT key to the C key by default).- Streams tab now includes 6 live streams.[MISC]- Scope lines now blur out completely to better match the weapon's current inaccuracy.- Improved Fiveseven viewmodel animation- Improved Tec-9 viewmodel animation\t\t\n"
    },
    {
        "id": "1407665761140379246",
        "timestamp": "17 Oct, 2013",
        "link": "http://store.steampowered.com/news/11654/",
        "entry": "\r\n\t\tRelease Notes for 10/17/2013[MAPS]- de_nuke: Decreased fog[UI]- Added Streams tab to Watch menu.- Friends rich presence now also includes the map if they are reviewing a match from their Match History.- Fixed being able to invite and message yourself in the Watch menu scoreboard.- Fixed hitches that would happen when updating match data in Watch menu.- Reduced memory footprint of Inventory menu.- Added warning that will show when you have have a corrupt download from Your Games tab.[GOTV]- Players in a match can now see the number of GOTV spectators in the scoreboard.- Added spectator count display to top live Competitive matches.- Added support for GOTV relays to allow a much large number of spectators for top live Competitive matches.- Added convar tv_maxclients_relayreserved which allows reserving a certain number of slots from tv_maxclients for GOTV relays.- Added convar tv_dispatchweight which allows better control of load balancing in relay chains, defaults to 1.25 which for every 4 local spectators will send 5 spectators to each connected relay.- Fixed empty GOTV spectator chat messages.[MISC]- Fixed a crash on startup- Fixed not being able to equip the default weapon into a loadout slot that previously contained a decorated weapon.- Improved decorated weapon material compositing to prevent dark patches on some weapons with clean exterior.\t\t\n"
    },
    {
        "id": "1407665032703066079",
        "timestamp": "10 Oct, 2013",
        "link": "http://store.steampowered.com/news/11604/",
        "entry": "\r\n\t\tRelease Notes for 10/10/2013[GAMEPLAY]- Improved grenade physics interaction with player models. Grenades bounce off player hitboxes instead of the overall player bounding volume.- Improved bomb-planting player animation to prevent unintentionally standing when the plant completes. (Thanks Friberg!).- Re-added support for alternate firing accuracy. This effectively buffs burst fire on the glock and the famas.[MAPS]- Fixed minor bugs in cs_siege and de_ruins.[UI]- Added the WATCH menu-- Watch live, in-progress matches played by highly-ranked CS:GO players-- Access your match history and review the scoreboard for your previous matches-- Download and watch any of your recent matches.-- Select 'GOTV Theater' to watch a continuous stream of live matches.- Pausing/disabling of the GOTV autodirector has been reverted to the old behavior.- Fixed a bug that allowed you to see the other team's weapons in a competitive game via the spectator menu if you were the last person to die on your team.- Fixed a case where spectator weapon panel would be missing the weapon in GOTV and demos.- Fixed a case where the code version of the weapon name would show up in the freeze panel.- Fixed the Team Value numbers not switching properly after halftime in GOTV or demo playback.- The bomb icon is now colored in the spectator view so it's more visible.[MISC]- Fixed \"Bad sequence in GetSequenceName\" viewmodel console warnings.\t\t\n"
    },
    {
        "id": "1459455885372710207",
        "timestamp": "4 Oct, 2013",
        "link": "http://store.steampowered.com/news/11579/",
        "entry": "\r\n\t\tRelease Notes for 10/4/2013[MAPS]Ali:-Updated with bugfixes.[UI]-Updated the spectator UI--Spectator UI shows all weapons that a player has equipped instead of just the grenades and currently equipped.--Moved the armor icons off of the player avatar and updated icon placements.--Added Team Round Value display when spectating that shows the current equipment value of the alive members of a team versus the other team.-Updated map selector UI to show more maps on a single page.-Fixed usp-s and m4a1-s icons not showing up in the spectator hud.-If the max rounds is set to > 999, it will display in the spectator UI as \"--\".-Fixed weapon icons being scaled improperly in the team scoreboard in Arms Race Mode.[MISC]-Grenades no longer bounce off chickens.-Fixed a money exploit in official competitive matchmaking.-Fixed potential issue where round backups could incorrectly restore some players as dead.-Fixed round backups not correctly restoring StatTrak knives for players.-Fixed a bug downloading workshop maps with Steam set to a non-English language.-Fixed additional memory leaks.\t\t\n"
    },
    {
        "id": "1462832954365425601",
        "timestamp": "26 Sep, 2013",
        "link": "http://store.steampowered.com/news/11535/",
        "entry": "\r\n\t\tRelease Notes for 9/25/13[BRAVO]-Added Competitive Scorecard to the Official Competitive match end scoreboard if the user owns an Operation Bravo Coin. (Previously only visible in the Operation Bravo Coin tooltip).[GAMEPLAY]-Suiciding now results in 0 cash awarded for the round.-Player acceleration is now determined by the player's active weapon max speed.[MAPS]-Fixed bugs in Gwalior, Cache, Ali, Seaside and Agency.[MISC]-Fixed stock items not displaying possessive information in the freeze panel.-Fixed some water material fallbacks to not reflect the 2d skybox which caused bad reflections with low shader settings.-Fixed squished weapon kill icons on Mac.-Fixed the highest quality items in a Collection failing to be filtered out of the Trade Up Contract interface.-Fixed a memory leak in client code that also caused performance drops during long gameplay sessions.-New decorated weapon added to the Assault Collection.\t\t\n"
    },
    {
        "id": "1461706326368863491",
        "timestamp": "19 Sep, 2013",
        "link": "http://store.steampowered.com/news/11490/",
        "entry": "\r\n\t\tRelease Notes for 9/19/2013[OPERATION BRAVO]- Added Operation Bravo Pass for access to Workshop maps in Deathmatch, Casual and Competitive. Visit http://blog.counter-strike.net/operationbravo/ for details![GAMEPLAY]- Fixed the buy menu not allowing players to buy a helmet+vest when they had a vest but not enough to buy the helmet+vest.[MAPS]- Inferno-- Removed flowerpots on balcony near Mid.-- Blocked visibility through haycart at Banana.-- Blocked visibility through sandbags in Banana.-- Blocked one way visibility through yellow car in Banana.- Mirage-- Tweaked cover in Bombsite A.-- Removed trashcan near connector into Bombsite A.-- Added cover at top of CT stairs into Bombsite A.-- Widened box near T tunnel into Bombsite A.-- Blocked visibility under the van at Bombsite B.-- Removed the red pushcart near Bombsite B.-- Removed bed in apartments near Bombsite B.-- Removed center divider in CT sniper window.-- Added cover inside Palace.-- Removed scaffolding in alley near Apartments, tweaked skybox volume.-- Removed chairs in Underpass.[UI]- Fixed vest and helmet+vest armor costs in the buy menu.- Fixed flashbang grenade overlap bug in the UI.- The \"flashed\" icon no longer shows up when the cl_draw_only_deathnotices is set.- Fixed missing localization text for status of players playing the Weapons Course.- Increased resolution of death message weapons icons.[MISC]- Replaced \"Arms Deal Collection Contract\" with \"Trade Up Contract\" that can be used with weapons from any Collection.- Holstered weapons now correctly show their silenced/unsilenced state.- Fixed expired Operation Payback Passes not being redeemable for Operation Payback Coin.[COMMUNITY SERVERS]- Fixed a community server crash in certain Deathmatch mode settings.- Fixed a community server file transfer exploit.- Custom map scenario text files can now contain \"RULESHERE\" as the very first thing in the text which will get replaced by the game mode rules that are currently being loaded. The rest of the scenario text file will be added to the end of the rules text.\t\t\n"
    },
    {
        "id": "1459453913326175021",
        "timestamp": "12 Sep, 2013",
        "link": "http://store.steampowered.com/news/11447/",
        "entry": "\r\n\t\tRelease Notes for 9/12/2013[CONTRACTS]- Added the Arms Deal Contract, allowing players to exchange items from the Arms Deal case.-- Use the Arms Deal Contract to exchange 10 of your Arms Deal Collection items of identical quality for a single Arms Deal Collection item of a quality one tier higher. Note: Knives are not part of collections.[ARMS DEAL]- It is now possible to use Name Tags on stock/default items.[UI]- Clan tags are now displayed in the lobby.[GAMEPLAY]- Players can now only purchase 1 smoke grenade per round.- Synchronized M4A1 and M4A4 reload completion event with visual magazine insertion and sound effect.- Improved some bad cases of player radar visibility through smoke volumes.- Enemy target IDs now only appear when the crosshair is over a target player's hitboxes instead of their overall bounding box.- Looking at a weapon in-game (default F) no longer interrupts attaching or detaching silencers.[MISC]- The kill panel now correctly displays item rarity and owner.- Kill panel damage given and received stats no longer add damage from before a player took over a bot.- Fixed weapon inventory hud flashing when it didn't find the selected weapon in edge cases where you just threw a grenade. - Fixed hud inventory not refreshing properly in some cases when picking up a flashbang.- Fixed a bug that reported \"hltv_changed_target\" as an unused event in the console.- Fixed weapon icons appearing dark for some Mac versions.- When watching friends games on official servers, GOTV information is now requested asynchronously from matchmaking servers.- CS:GO inventory items in Steam Community profiles now list most recently acquired items first.- Improved CS:GO matchmaking servers stability.- Fixed context menu popping up over the client info panel in the lobby.- Added a cheat protected convar named \"cl_draw_only_deathnotices\" that turns off most hud except for death notices (for movie makers).\t\t\n"
    },
    {
        "id": "1477467113271728298",
        "timestamp": "29 Aug, 2013",
        "link": "http://store.steampowered.com/news/11361/",
        "entry": "\r\n\t\tRelease Notes for 8/29/2013[UI]- Added ability to rename a weapon’s name with a custom engraved nameplate via Name Tags.  - Simplified trading with other players by adding a Start Chat button to CS:GO profiles.  [GAMEPLAY]- Chicken changes based on pro feedback:-- Reduced chicken sounds dBs and volume.-- Reduced idle clucking rate.-- Reduced range that scares chickens when running.[MISC]- Adjusted Weapon Case Key and Payback Pass prices for foreign currencies based on current international exchange rates.- Fixed an issue causing poor rendering performance, especially for SLI/Crossfire users.  - Fixed M4A4 loadout selection not saving correctly between sessions.  - Fixed competitive round backups restoring M4A1-S as M4A4 and USP-S as P2000.- Fixed observers seeing smoke screen overlay when a smoke grenade popped on their last alive position.- Fixed bomb activate/plant/defuse sounds not playing if the bomb was out of view- Fixed Payback Coin description incorrectly displaying the number of hours logged in game.- Fixed missing localization for Payback map maker Coins.- Fixed an empty item panel sometimes showing on the scoreboard.- Fixed Elite world model physics.- Added flipping sound to inspecting the Desert Eagle.\t\t\n"
    },
    {
        "id": "1480844086851802997",
        "timestamp": "22 Aug, 2013",
        "link": "http://store.steampowered.com/news/11310/",
        "entry": "\r\n\t\tRelease Notes for 8/21/2013[GAMEPLAY]- SSG08:  -- Reduced price from 2500 to 2000.-- Reduced standing and crouching accuracy recovery times.- Reduced Molotov price from 500 to 400.- Reduced Incendiary Grenade price from 850 to 600.- Reduced Glock damage from 33 to 28.- Fixed bug that NiP discovered where the aimpunch experienced when compensating for recoil was incorrect.- Third person silenced muzzleflash light brightness is no longer a portion of unsilenced brightness, instead it is now completely removed.- Chickens are no longer scared when moving silently near them or shooting near them with silenced weapons.- Fixed a bug where removing/adding a silencer would also drop a magazine on the ground.[MAPS]- Fixed map placed weapons not working properly.Aztec: --New connector between A and B bombsites.--More cover in underpass.--More cover in overpass.--More cover at bombsite A.--Changed cover at CT side of bridge.--Removed railings on bridge.--Added player collision inside large vegetation models.--Removed collision on some props.--Clipped stairs.--Reduced fog.--Reduced noise in textures.Train: --Tweaked shower room.--Moved ladders to ends of traincars.--Made T entrance into bombsite A wider.--Reduced size of CT sniper position.--Removed some cover from CT sniper position.--Blocked visibility under electrical box at bombsite A.--Blocked visibility through yellow barrels at bombsite A.--Brightened textures near bombsite A.--Removed some wires at bombsite A.--Blocked visibility under traincars.--Rearranged trains at bombsite B.--Widened back of bombsite B, T side.--Replaced cover at back of bombsite B, T side.--Clipped stairs.--Optimizations.--Fixed radar naming.--Blocked visibility through concrete bags near Ivy.--Brightened door near Ivy.--Removed railing at top of ladder.--Brightened environment light.--Reduced fog.Inferno:--Fixed missing collision in an area in mid.--Made railing at back of bombsite A easier to see through.--Widened doors in construction.--Reduced wall penetration in construction.--Removed wall supports in apartments hallway.--Increased C4 explosion radius to make it consistent with other maps.Nuke: --Fixed a bug in ramp room.--Widened door in rafters.--Fixed some radar naming bugs.--Increased C4 explosion radius to make it consistent with other maps.Mirage: --Added more light to CT window into bombsite B.--Fixed some graphical bugs.--Removed small trashbags that could be mistaken for players.Dust2: --Made it easier to spot enemies at back of long A, CT side.--Removed center scaffolding in tunnels.[UI]- Added warning message for when there is a new update available.- Fixed Main Menu for 21x9 monitors.- Weapon Case Unlock Animation:\t-- Fixed animation stopping on an item when the connection to the item server is actually unresponsive.-- Fixed animation not closing if error dialog occurs.-- Fixed animation restarting if space bar was pressed.- In-game previews of StatTrak™ weapons and unusual knives now correctly display those attributes in the name.- Weapon target ID text now colors the weapon the color of its rarity.- Fixed StatTrak HUD element for knives hiding.- Fixed Tooltip backgrounds disappearing when browsing Workshop maps.- Fixed Matchmaking 'ACCEPT' button not reappearing after you accept a match and not everyone accepts.- Fixed spectator player panels were showing up when they shouldn't be (wrong team, wrong mode, etc).- Fixed the spectator panel not using the new knife icons properly.- Moved the “flashed” icon from the center of the screen, made it more subtle and added fringe fades for when your target is flashed when connected via GOTV.- Fixed Rescue Kit displaying as Defuse Kit in hostage maps.- Fixed pause menu missing entries.- Fixed item drops displaying for 'Unknown' players.- Fixed formatting of AWP kill award text in Classic Competitive.- Teammate’s names now always show overhead during freeze time.- Additional work on inventory, addressing edge cases where HUD positions would not update properly after a weapon had been added or removed.[MISC]- Added \"Five Year Veteran Coin\" awarded to players who were a member of the Counter-Strike community for over 5 years.- Fixed Overwatch not displaying new cases after viewing one case.- Fixed extended delay in the end of Classic Competitive games that had GOTV spectators.- While watching matches in GOTV, the Autodirector is paused, not deactivated, if the spectator follows a specific player.- Added weapon_m4a1_silencer and weapon_usp_silencer FGD entries for map makers.- Fixed several exploits affecting dedicated servers.- Added a server convar sv_quota_stringcmdspersecond to allow rate-limiting client string commands.- Reduced memory usage on dedicated server.- Fixed weapon switch and knife swing animations being choppy at low ping.- Stability fixes in shaders- Identified a memory allocation bug involving nVidia Geforce Drivers version 320.49 or earlier. We suggest that you update to the latest beta driver version 326.80.\t\t\n"
    },
    {
        "id": "1478591723582125385",
        "timestamp": "14 Aug, 2013",
        "link": "http://store.steampowered.com/news/11265/",
        "entry": "\r\n\t\tRelease Notes for 8/14/2013[ARMS DEAL UPDATE]-Visit http://blog.counter-strike.net/armsdeal/ for complete details.--Ten Weapon Collections have been released.--Standard and eSports Weapon Cases now available - a portion of the proceeds from eSports Weapon Case Key sales will help support prize pools for upcoming community competitive CS:GO tournaments. --Weapon Cases have a chance to contain new knives and StatTrak weapons, which track all player kills with that weapon.--Players can receive decorated weapons through timed item drops, available on any VAC-secure server.-All Arms Deal Update items can be traded.-All Arms Deal Update items can be sold and purchased through the Steam Marketplace (visit the FAQ for details).-Every decorated weapon has a unique finish and exterior condition and can be thoroughly inspected in game. The ability to launch the in-game inspection view for an item is available in the Steam Inventory, Community Market, and Steam Trading.[UI]-Upgraded Scaleform version to 4.2.-Improved memory management of Scaleform UI elements.-Added Inventory to Main Menu and the In-Game Pause Menu.-Added Loadout to Main Menu and the In-Game Pause Menu.-Added blog.counter-strike.net blog to the main menu-Added drop shadows to some UI element text for improved readability.-Improved some HUD layouts to avoid overlap.-Game no longer truncates player names in most HUD UI elements. Fonts will now scale down to fit the full string.-When a player picks up a weapon, the original owner of that weapon will now be indicated.-Fixed certain buttons missing clicks[GAMEPLAY]-Added Silenced M4A1.-Added Silenced USP.-New weapons can be equipped through the Inventory UI.-When a player reloads their weapon, they now drop a magazine that persists in the world. -Machine gun belts now visually match the ammo count in the viewmodel when firing and reloading.-Added holdable action key +lookatweapon that allows players to visually inspect their first person weapon while in-game. This has been bound to the F key by default (if that key was previously unbound).-Players now automatically crouch while planting bombs.[MATCHMAKING]-Adding matchmaking servers in Brazil.\t\t\n"
    },
    {
        "id": "1478588572363470503",
        "timestamp": "10 Jul, 2013",
        "link": "http://store.steampowered.com/news/11073/",
        "entry": "\r\n\t\tRelease Notes for 7/10/2013[ GAMEPLAY ]- Adjusted the function that mapped movement speed to weapon inaccuracy. The linear portion of this function is now exponential.[ MAPS ]- de_dust2: Fixed collision bug in Bombsite B, tweaked fog, fixed navmesh naming.[ MISC ]- Added support for more Unicode characters in player names.- Fixed a rare incorrect name truncation in the death notice feed, scoreboard and main menu.- Fixed truncation of the competitive maps selection when all maps were selected.- Smoke volume is now cheaper to render.- Players that spawn and don't move for longer than sv_spawn_afk_bomb_drop_time (default 15 seconds) will automatically drop the bomb. Thanks GreenTea!\t\t\n"
    },
    {
        "id": "1479713748803202122",
        "timestamp": "3 Jul, 2013",
        "link": "http://store.steampowered.com/news/11029/",
        "entry": "\r\n\t\t[ MISC ]- Playing a demo recorded on a workshop map will attempt to automatically download and display that workshop map.- Added a convar cl_download_demoplayer to control whether demo player is allowed to download external resources, defaults to 1 allowing downloads from workshop, allows 2 for downloading all other external resources that could be referenced by community server.- Added engine support for versioning official maps, so demo playback will seamlessly download and load matching version of the map when playing back older demos. ( Currently supports Nuke, Inferno, Dust2 )- Fixed rare crashes in HUD when game events were received before HUD elements were fully loaded.[ GAMEPLAY ]- Additional minor buffs to the Aug and Sig.- Smoke grenades have been adjusted to make their view-obscuring overlay match the smoke volume shape more precisely as well as some other minor fixes.[ SPECTATING ]- Spectating a flashed player via GOTV now shows an additional effect and icon to indicate blindness without obscuring the spectators view.- Fixed a case where GOTV spectator would get the round radar template instead of the square one.- Grenade trajectories are now on by default in spectator x-ray view. Convar sv_grenade_trajectory_time_spectator will adjust visible trail duration.[ MAPS ]- Made a pass at incorporating some lessons learned from Mirage to original maps. Also, bug fixes.De_Inferno:- Widened apartment hallway near A- Replaced red car in middle with solid cover- Fixed radar naming on haycart- Improved visibilityDe_Nuke:- Added radar namesBug fixes- Improved visibilityDe_Dust2:- Improved visibility- Bug fixesDe_Aztec:- Improved visibilityDe_Train:- Improved visibility\t\t\n"
    },
    {
        "id": "1478587214454729580",
        "timestamp": "26 Jun, 2013",
        "link": "http://store.steampowered.com/news/10963/",
        "entry": "\r\n\t\tRelease Notes for 6/26/2013[ WEAPONS ]- Further adjustments to the AUG/SG553.[ MAPS ]- de_mirage: Minor bugfixes.- de_vertigo: Fixed bombsite naming, other minor bugfixes.[ OVERWATCH ]- Improved Overwatch test case distribution system.[ MISC ]- Whitelisted convars sv_vote_issue_kick_allowed and sv_vote_kick_ban_duration.- Added a server concommand \"removeallids\" to unban all user IDs.- Keybindings are no longer processed in front end when not connected to a server, fixes unexpected keybindings processing in main menu and when chatting in play with friends lobby.- Fixed players in invalid Steam purchase regions getting error dialogs during play.- Fixed votes incorrectly displaying player names with formatting symbols.- Fixed a rare bug where friendly fire damage could count raw damage inflicted instead of actual health points subtracted towards warning or kicking for too much team damage.- Official classic competitive matches will always allow players to connect even in rare cases when they were kicked and banned from the same game server instance during a previous classic casual game.- When a player receives a cooldown for being kicked from too many matches it will show up on their main menu immediately and will not be delayed until the competitive match end.- Adjusted the competitive cooldown for being kicked from too many matches to correspond to the violator's offense level starting at 30 minutes if it was the first competitive violation and following same cooldown computation rules as other types of cooldowns.- A player who was matchmaking solo and was kicked by a party of 4 teammates will not receive a competitive cooldown for being kicked from too many matches.- Exposed cl_interpolate convar, allows to disable entity interpolation during demo playback or on listen servers, interpolation is enabled regardless of client setting when connected to dedicated servers.- Added grenade trajectories when in spectator mode with glows on. Set sv_grenade_trajectory_time_spectator 1 to turn them on.- Fixed a crash on OSX 10.6.8 when downloading custom maps resources from community servers.\t\t\n"
    },
    {
        "id": "1497726886789141634",
        "timestamp": "19 Jun, 2013",
        "link": "http://store.steampowered.com/news/10898/",
        "entry": "\r\n\t\tRelease Notes for 6/19/2013[ WEAPONS ]- Tuned the AUG and SG553 to function more effectively as a rifle/sniper hybrid.[ MAPS ]- de_mirage: Fixed see-through crates at bombsites, various other bugfixes.- Fixed kv files packaged in workshop maps not loading correctly, which could display incorrect player models and arms.[ OVERWATCH ]- Improved interpolation during Overwatch evidence playback.[ MISC ]- Added classic competitive map to in-game friends list information text.- Fixed rare uninitialized text \"Target Area\" appearing on-screen when watching GOTV.- Fixed sv_grenade_trajectory linux crash- Added new sv_grenade_trajectory convars to display a dashed line and to adjust line thickness and duration.\t\t\n"
    },
    {
        "id": "1496600434912358126",
        "timestamp": "12 Jun, 2013",
        "link": "http://store.steampowered.com/news/10855/",
        "entry": "\r\n\t\tRelease Notes for 6/12/2013[ MAPS ]- Added de_mirage.- Added console command to help players plan strategic grenades. Set sv_grenade_trajectory 1 (cheat convar) to see a visual arc in-game.[ OVERWATCH ]- Overwatch Investigators are now required to submit more detailed verdict reports after reviewing evidence.- Fixed interpolation issues during GOTV and Overwatch demo playback which caused the weapon of a shooting player to visually appear several ticks behind the moment a victim was hit.- Overwatch FAQ updated. http://blog.counter-strike.net/index.php/overwatch/[ OPERATION PAYBACK ]- Operation Payback Pass on sale for $0.99 until Monday 6/17.[ UI ]- Added links to top streams on the main menu.- Added an audio option to reduce game music volume when Steam Overlay is activated.[ MISC ]- Restored the \"retry\" console command.- Players can only submit griefing reports for teammates.\t\t\n"
    },
    {
        "id": "1498851600711148428",
        "timestamp": "5 Jun, 2013",
        "link": "http://store.steampowered.com/news/10799/",
        "entry": "\r\n\t\tRelease Notes for 6/5/2013[ OVERWATCH ]- Added more investigators to the Overwatch Beta.[ MISC ]- Added an explanation for no binary signature validation for clients running in -insecure mode.- Fixed an exploit where clients could bypass network convar restrictions using setinfo.- The crosshair gap size will no longer change when switching weapons while using \"Classic Static\" (cl_crosshairstyle 4)  --  other crosshair styles are unaffected.\t\t\n"
    },
    {
        "id": "1496599168066619345",
        "timestamp": "29 May, 2013",
        "link": "http://store.steampowered.com/news/10734/",
        "entry": "\r\n\t\tRelease Notes for 5/29/2013[ OVERWATCH ]- Updated Overwatch FAQ (http://blog.counter-strike.net/index.php/overwatch/)- Overwatch case reviews will highlight kills and assists from The Suspect in kills feed.- Overwatch case reviews will not record the team name when all five players play with their clan tag.- Servers running with default setting sv_kick_players_with_cooldown 1 will not allow players convicted by Overwatch to play, setting it to 0 will allow convicted players to join.[ STEAM BADGES ]- Updated CS:GO Steam trading card art to their final designs and names[ MISC ]- Fixed an exploit with disconnecting and reconnecting players being able to respawn in the same round.- Network interpolation and update convars can no longer be changed when playing. To configure these convars, players must not be connected to a server or must join the spectators.- Enforced signature validation of game dlls and plugins. Clients launching with tampered dlls will be informed of the invalid signatures error, and will not be allowed to connect to VAC secure servers to avoid being VAC banned.- Fixed a problem in the GOTV recorder that could result in some non-delayed data getting written into the recorded stream, causing playback artifacts.\t\t\n"
    },
    {
        "id": "1462821444631800996",
        "timestamp": "22 May, 2013",
        "link": "http://store.steampowered.com/news/10669/",
        "entry": "\r\n\t\tRelease Notes for 5/22/2013[ OVERWATCH ]- Started the Overwatch beta http://blog.counter-strike.net/index.php/overwatch/.[ MISC ]- Added two new convars, cl_crosshair_drawoutline and cl_crosshair_outlinethickness, that will enable a black outline to draw around the classic crosshair pips for better visibility.\t\t\n"
    },
    {
        "id": "1461694911261452020",
        "timestamp": "15 May, 2013",
        "link": "http://store.steampowered.com/news/10619/",
        "entry": "\r\n\t\tRelease Notes for 5/15/2013[ MAPS ]- de_train: Fixed grenade collision bug, other minor bugs.[ MISC ]- Added a convar sv_vote_allow_in_warmup defaulting to off and controlling whether votes are allowed during warmup.- Shooting through a nodraw surface now doesn't count as a gun penetration (you can always shoot through nodraw).- Consolidated Map Groups in Classic Casual and Demolition modes.\t\t\n"
    },
    {
        "id": "1459442480370321921",
        "timestamp": "10 May, 2013",
        "link": "http://store.steampowered.com/news/10587/",
        "entry": "\r\n\t\tRelease Notes for 5/10/2013[ MISC ]- Fixed an exploit of CTs boosting and picking up hostages through thin floors.- Restored proper grenade interaction with breakable surfaces.\t\t\n"
    },
    {
        "id": "1459442480308079431",
        "timestamp": "8 May, 2013",
        "link": "http://store.steampowered.com/news/10566/",
        "entry": "\r\n\t\tRelease Notes for 5/8/2013[ GAMEPLAY ]- Mag7 - reduced cost to 1800.- Mac10 - increased price to 1050.- XM1014 - reduced damage to 20.- Body parts penetration code will not register headshot damage when penetrating into the neck hitbox through the chest hitbox, only chest damage will be dealt in this case.[ MAPS ]- Updated de_favela to latest version.- Fixed some bugs in de_inferno where the player could get stuck on geometry, fixed some minor bugs (Thanks Wλve!).[ MISC ]- If a player was vote kicked from too many recent competitive games the matchmaking system will assign them a competitive cooldown.- Added sever command line support for -net_port_try 1 to prevent servers from trying to climb ports if the request port was busy.- Fixed a rare grenade physics interaction that could cause grenades to spin in place when thrown at certain kinds of physics props or players.- Adjusted default value of sv_maxusrcmdprocessticks server convar to 16 for community servers with default settings to successfully process all user commands from even lowest tickrate and framerate clients.- When going to overtime players who survived in the last round will start with empty inventory even though teams don't switch sides.- Fixed flashbang number not updating on the hud if you had set \"close after buy.\"\t\t\n"
    },
    {
        "id": "1462819626616007604",
        "timestamp": "1 May, 2013",
        "link": "http://store.steampowered.com/news/10526/",
        "entry": "\r\n\t\tRelease Notes for 5/1/2013[ GAMEPLAY ]-Tweaked weapons  &nbspDEAGLE: Reduced inaccuracy.  &nbspMag-7: Increased cycletime. Increased cost.  &nbspXM-1014: Increased ArmorRatio. Increased cycletime.  &nbspUMP-45: Reduced price. Reduced recoil angle variance.  &nbspMac-10: Increased maxspeed. Reduced price.-Classic Competitive now allows 2 flashbangs and 4 grenades total.-Implemented bodygroups penetration for maximum damage, now shooting through arms at the enemies head will apply headshot damage, or shooting through arms at the stomach will apply stomach damage multiplier.-Removed aimpunch resulting from getting shot in the arms or legs.-Auto switch when dropping a weapon (or after throwing a grenade) avoids weapons with 0 bullets in the clip.-Reduced environment fog when scoped with a weapon.[ MAPS ] -CS_Militia: Fixed collision in CT spawn, added radar names-CS_Assault: Added radar names-CS_Museum: Fixed and updated radar and overview scales.-DE_Library: Fixed bug where some clients would crash on bomb explosion.-DE_Favela: Fixed bug were a prop was causing server lag, other gameplay tweaks-DE_Seaside: Fixed bug were players would get stuck near Terrorist spawn.[ MISC ]-Weapon inventory HUD now displays the number of grenades held of a single type.-Fixed a sound bug that resulted in ghost footsteps when taking over bots.-Fixed player money getting set to the wrong value if the player took over a bot in competitive and survived to the end of the round.-Added a server convar \"sv_maxusrcmdprocessticks\" to limit maximum number of user commands backlog, defaulting at 3; observed player speed by others will now always be within max movement speed even when user is cheating, experiencing high packet loss or exteremely low fps.-Vote kick will record user's SteamID in the banlist and remove user from ongoing competitive match even if the user disconnected from game server before required number of votes have been collected.-Spectating Operation Payback games via GOTV is now allowed without Operation Payback pass.-Fixed crash on exit.\t\t\n"
    },
    {
        "id": "1459441364820958415",
        "timestamp": "26 Apr, 2013",
        "link": "http://store.steampowered.com/news/10489/",
        "entry": "\r\n\t\tRelease notes for 4/26/2013[ MISC ]- Reduced cl_radar_scale minimum from 0.4 to 0.25.- Fixed a problem where workshop maps included in Operation Payback weren't playable on community servers without Operation Payback Pass.- Fixed a problem where Operation Payback banner could sometimes show up over friends in Play With Friends lobby.- Added an explanation to Operation Payback Pass to indicate that Operation Payback is a mapgroup for Classic Casual mode.\t\t\n"
    },
    {
        "id": "1459441364821261687",
        "timestamp": "25 Apr, 2013",
        "link": "http://store.steampowered.com/news/10490/",
        "entry": "\r\n\t\tRelease Notes for 4/26/2013 [ OPERATION PAYBACK ]- Uploaded “Operation Payback, “ a Classic Casual map group made up of seven top-rated Workshop maps on official servers- Allowed players to invite friends to play “OP” even if they haven’t purchased- Added upgradeable challenge coin, viewable in avatar, that progresses from bronze to silver to gold with play[ RADAR ]- Spectators' radar was replaced with a minimap, allowing for better orientation and action-following without resorting to the overview.- When playing competitive or with sv_competitive_official_5v5 set, the minimap will show player hotkey values like the overview map does.- Added convar cl_radar_always_centered ( default 1 ) then when set to 0 makes more efficient use of the radar at the expense of moving the POV away from the center.- Added 2 options to the radar, allowing players to change the scale and orientation. These are exposed in the Game Settings menu, or directly with the cl_radar_scale ( default 0.7 ) and cl_radar_rotate ( default 1 ) convars, respectively.- Added convar cl_radar_icon_scale_min ( default 0.6 ) that allows radar icons to be kept large when the scale is reduced.- Moved the planted bomb icon from below the radar to the timer.- Fixed radar showing above or below on a player when spectating them from chase.[ CS:GO PLAYER PROFILE ] - All players can now view other players medals/coins on the in-game Player Profile page.- Friends can now view your wins and Skill Group on your in-game Player Profile page.- You can now view a Player's Profile page by hitting Z (the Command Radio Message key) when spectating that player.- Added a shortcut to view a friend's CS:GO Player Profile page from the main menu friends list.[ MISC ]- Added \"Disable Autogenerated DM Spawns?\" to info_map_parameters entity that allows mapper to specify that no dm spawns should be autogenerated and will be mapper-placed instead.- Added more options for map filtering in server browser:  &nbsp-The default map filter now performs substring matching. (dust will find de_dust2_se, cs_dustyhouse, workshop or fastdl versions of maps, etc.)  &nbsp-A single slash will search for a prefix in the base map name. (/cs will search for all hostage rescue maps)  &nbsp-An asterisk will search for a map name suffix. (*_se will search for any map ending in \"_se\")  &nbsp-A double slash will search for an exact map name prefix. (///125488374/ will search for the official workshop de_dust2_se. ///official will search for all official workshop non-se maps)- Added support for official cs_militia map workshop id 133256570 to be played as part of dedicated servers workshop collection mapcycle.\t\t\n"
    },
    {
        "id": "1462817008585712398",
        "timestamp": "3 Apr, 2013",
        "link": "http://store.steampowered.com/news/10331/",
        "entry": "\r\n\t\tRelease Notes for 4/3/2013[ MISC ]- Fixed a bug where a player who joined team during halftime pause would not correctly switch teams together with teammates for the second half.- Fixed auto team balancing code to not move players to other team during official competitive match after several players on one team abandoned the game.- Added hostage spawn location indices to round backup files.- Fixed loser money not restoring correctly from round backups at halftime.- Fixed an exploit on de_vertigo.- Added Macedonia country flag (MK)\t\t\n"
    },
    {
        "id": "1461690471650122234",
        "timestamp": "27 Mar, 2013",
        "link": "http://store.steampowered.com/news/10265/",
        "entry": "\r\n\t\tRelease Notes for 3/27/2013[ MISC ]- If CTs rescue a hostage and win game now plays \"Hostage has been rescued\" announcement before announcing \"Counter-Terrorists Win\".- Hostages now correctly drop to ground when hostage carrier was killed mid-air.- Menus will now correctly display on various resolution ratios including 5:4 and triple monitor- Friends panel will now display an invited icon for invited friends.- Fixed mouse input in demo playback .- Lobby leader is now highlighted in lobby.- Various layout changes to Lobby and Scoreboard.- Map makers can now choose to show a custom loading image in place of the map overview/radar image &nbsp--To do this, place a .jpg image in the same directory as the .bsp (in maps) named _loading.jpg (it needs to be packed manually into the bsp before uploading to the workshop)- Fixed player viewmodel arms rendering inside out when cl_righthand was set to 0- Added back player_say game event for server plugins.\t\t\n"
    },
    {
        "id": "1461689837242961871",
        "timestamp": "21 Mar, 2013",
        "link": "http://store.steampowered.com/news/10208/",
        "entry": "\r\n\t\tRelease Notes for 3/21/2013- Added new Hostage Rescue map cs_militia- Update Hostage Rescue Mode rules- Hostage positions are randomly assigned at the beginning of the match. The hostages will start at these positions for the entire match.- Hostages are now carried by CTs instead of following behind.- Hold +use for 4 seconds to pick up a hostage. (Equipping a rescue kit will decrease the time required to 1 second.)- CTs win a round when the first hostage is rescued.- Reduced round timer. Round time is extended when the first hostage has been picked up.- Rebalanced money rewards to accommodate new rules.- Hostages now indicate whether they are above or below you on the radar.- cs_office, cs_assault, and cs_italy have updated to use random hostage spawn points.- Added convars to modify new hostage rules-- mp_hostages_max - Sets the maximum number of hostages to spawn.-- mp_hostages_rescuetime - Setting 0 removes the time extension when CTs pick up the first hostage.-- mp_hostages_spawn_farthest - Setting 1 forces hostage spawn points to choose be the farthest possible combinations.-- mp_hostages_spawn_force_positions - Setting a comma separate list (ex: 0,2 ) forces specific hostage spawn point combinations.-- mp_hostages_spawn_same_every_round - Setting 0 randomizes the hostage spawn points every round.-- mp_hostages_takedamage - Setting 0 allows hostages to be hurt.- Added hostage entity properties for new hostage rules-- HostageSpawnRandomFactor - Allows to increase probability of hostage random spawning rules to use that spawn point.-- HostageSpawnExclusionGroupN - Hostages sharing same spawn exclusion group will never spawn together.- The action of defusing a bomb will now terminate when you turn your view too far from facing the bomb.- Players always play a quiet client-side jump sound that can only be heard by the jumper.- Players play the regular jump (step) sound when moving greater than walk speed that can be heard by both the jumper and all clients in earshot.- The timer that performs the random map selection visuals now properly gets killed when the scoreboard hides.- Fixed convar mp_weapons_allow_map_place not properly eliminating map-placed weapons. NOTE: FY servers will need to set this convar to 1.- Added an option to func_dustmotes entity volumes that lets them choose to not be affected by wind.- Fixed in-game clipping for triple-monitor rendering configurations.- Added overtime indicator to GOTV spectators miniscoreboard.- Radar should now correctly follow spectated player when spectating via GOTV.- Adjusted score and MVP rewards for gameplay events related to planting, defending and defusing the bomb, and for reaching, protecting and extracting hostages.- Steam overlay game details will now correctly show players score.- Fixed special characters of player name not correctly displaying in some UI elements.- Fixed a bug where friends were banned from joining parties where one of the members failed to recently accept a competitive match.\t\t\n"
    },
    {
        "id": "1495465667726367659",
        "timestamp": "11 Mar, 2013",
        "link": "http://store.steampowered.com/news/10118/",
        "entry": "\r\n\t\tRelease Notes for 3/11/2013[ MISC ]- Fixed the end match map vote sometimes selecting the wrong map as winner- Fixed a crash in dedicated servers related to the end match map vote- Players can no longer cast a vote outside the range of maps in the end match map vote list\t\t\n"
    },
    {
        "id": "1495465667624620037",
        "timestamp": "8 Mar, 2013",
        "link": "http://store.steampowered.com/news/10112/",
        "entry": "\r\n\t\tRelease Notes for 3/8/2013[ MISC ]- The convar mp_endmatch_votenextmap (defaults to 1) is now accessible to everyone.- If a server is running a map group with more than 10 maps in it, a random set of 10 maps will be selected from the group and will be shown to clients at the end of the match in the map vote list.- Added mp_endmatch_votenextmap_keepcurrent (defaults to 1) that forces the current map to stay in the list of end match voting options. If not set, the current map is not guaranteed to be in the list and will randomly enter the list like any other map.- Resolved a few bugs with the new random map selection.\t\t\n"
    },
    {
        "id": "1495465667580080840",
        "timestamp": "7 Mar, 2013",
        "link": "http://store.steampowered.com/news/10094/",
        "entry": "\r\n\t\tRelease Notes for 3/7/2013[MISC]- Dedicated servers hosting workshop maps now record previously hosted collection information. This allows workshop servers to keep operating when steam servers are down.- Old versions of workshop maps now properly remove themselves from disk when the map gets renamed.- If a server is running a map group and has mp_endmatch_votenextmap set to 1, players vote for the next map at the end of the match- Fixed a regression where leaderboards were sometimes not getting updated for classic competitive mode.- Added concommand tv_time_remaining that prints how much time is remaining to the broadcast after the match has ended. This provides admins a method to confirm that the broadcast is complete before changing the level.- Round backup files now correctly strip workshop path when expanding %map% pattern token.- Round backups now correctly restore player team assignments even when restoring backup from other match half or from halftime.- Round backups support restoring match in overtime phase.- mp_warmup_end can now only be called if in warmup.- Team changes in warmup now take effect immediately.[ TOURNAMENT ]- Added built-in game rules for resolving tied tournament matches in overtime periods.- Overtime convars:- mp_overtime_enable ( default 0 ) - match will go to overtime if tied in regulation time.- mp_overtime_maxrounds( default 6 ) - sets number of rounds for overtime, teams switch sides halfway through the overtime.- mp_overtime_startmoney( default 10000 ) - sets starting money for each overtime half.- mp_overtime_halftime_pausetimer - when enabled will turn on another convar mp_halftime_pausetimer after tied regulation time and after each overtime half which would require match server admin/bot to set mp_halftime_pausetimer to zero when teams are ready to proceed.\t\t\n"
    },
    {
        "id": "1498842001392434251",
        "timestamp": "20 Feb, 2013",
        "link": "http://store.steampowered.com/news/9996/",
        "entry": "\r\n\t\tRelease Notes for 2/20/2013[ MISC ]- Reduced Glock damage.- Reduced Deagle inaccuracy.- Reduced Fiveseven and Tec9 prices.- Added checks to prevent clients from executing workshop concommands.- GameModes.txt and individual map kv files now get updated and loaded everytime a new map is loaded.- Newly subscribed maps in workshop map selector are sorted to the start of the list.- Fixed some cases where workshop maps failed to download.- Added status indicator to main menu that shows if maps are currently downloading.- Added convar sv_rcon_whitelist_address, rcon clients failing to auth from the specified IP address will never get banned.- Fixed Windows GOTV relays crashing when running without Steam client.- Improved handling of workshop maps on GOTV relays.- Added support for specifying +tv_enable 1 +tv_relay ip:port on GOTV relay commandline.\t\t\n"
    },
    {
        "id": "1495463757481382188",
        "timestamp": "13 Feb, 2013",
        "link": "http://store.steampowered.com/news/9942/",
        "entry": "\r\n\t\tRelease Notes for 2/13/2013* Deagle: increased effective range.* P250: reduced effective range.* Glock: increased recoil on burst.* Added a community dedicated server convar \"sv_workshop_allow_other_maps\". When this option is enabled and the server is idling empty, it will allow players to reserve it on another workshop map. Server will then download the other workshop map and let players play it, after the map ends the players will mapcycle into workshop collection hosted by the server.* Added a game setting 'Max Acceptable Matchmaking Ping' to allow users in geographic locations far from official datacenters to find games via matchmaking without using developer's console.* Servers starting to host a workshop collection will no longer show up as running de_dust.* Added convar mp_death_drop_c4 that determines whether C4 is droppable.* Fixed not being able to drop C4 in Demolition mode.* Added display of public joinable games in maps workshop browser.* Fixed dead players getting a network update that showed their dead icon position at the position of the player they jumped to spectate right after dying* Fixed mapcycle problems when the server was playing a map outside of active mapgroup or collection.* Workshop maps no longer show \"workshop\" prefix on master server and official maps show \"official\" instead of map id when played as part of hosted workshop collection.* Fixed the post processing effects (like blur) persisting through a level change to the new map if the new map does not contain a postprocess_controller entity.* Fixed some sv convars so they can be executed via map cfg files* Fixed the regular radar images not showing on the loading screen for workshop/custom maps* Fixed an interpolation exploit with bogus update rates.* Fixed a regression where old protobuf demo files failed to play. All protobuf demos should be playable again.* Maps that are newly subscribed are now highlighted as NEW in the UI.\t\t\n"
    },
    {
        "id": "1497714835861793513",
        "timestamp": "7 Feb, 2013",
        "link": "http://store.steampowered.com/news/9910/",
        "entry": "\r\n\t\tRelease Notes for 2/7/2013[MISC]- Added 'workshop_start_map' command line param to specify which map in a workshop collection for the server to start on. Takes the desired map's file id.- Password-protected community servers are no longer available for community matchmaking.- Map name is now correctly reported to master server.- Added spawn points in cs_assault.- Convars now get reset to defaults before server.cfg is executed.- Fixed a dedicated server crash after player disconnection.- Fixed respawn pop-up showing when you could not respawn in some cases.- Fixed bug in respawning if team spawn point counts were asymmetrical.- Fixed prop_dynamic_glow's not getting a final network update.- Fixed webapi authkey behavior on Linux dedicated servers.- Fixed layout of player details screen.\t\t\n"
    },
    {
        "id": "1497714835852727692",
        "timestamp": "7 Feb, 2013",
        "link": "http://store.steampowered.com/news/9905/",
        "entry": "\r\n\t\tRelease Notes for 2/7/2013[NOTABLE]-Added the CS:GO Maps Workshop. &nbsp-Maps Workshop tab now available in client Map Browser &nbsp-Maps Workshop FAQ: http://blog.counter-strike.net/workshop/faq.php &nbsp-Workshop url: http://steamcommunity.com/workshop/browse/?appid=730 &nbsp-Server Operators details: https://developer.valvesoftware.com/wiki/CSGO_Workshop_For_Server_Operators &nbsp-Upload tool for Map Makers: https://developer.valvesoftware.com/wiki/CSGO_Map_Publish_Tool &nbsp-Information about custom game rules: https://developer.valvesoftware.com/wiki/CSGO_Custom_Game_Mode-Added cs_assault to Classic map group.\t\t\n"
    },
    {
        "id": "1497714198926211474",
        "timestamp": "30 Jan, 2013",
        "link": "http://store.steampowered.com/news/9857/",
        "entry": "\r\n\t\tRelease Notes for 1/30/2013[ NOTABLE ]- Nerfed the Deagle.- Added a feature to spectate friends games via GOTV. &nbsp-In 'Play With Friends,' if a friend is on an official matchmaking server the WATCH option will appear next to their name.- DM immunity changes: &nbsp-Default immunity was raised to 10s. &nbsp-Moving cancels immunity.[ MISC ]- Fixed dedicated server memory leak.- Reserved server with connected GOTV spectators will hold reservation after all players disconnected for at least TV delay time to allow spectators to watch the match to the end.- Added convar sv_hibernate_punt_tv_clients to also punt lingering TV spectators after all players disconnected and at least TV delay time elapsed.tv_snapshotrate will now correctly adjust client-side rates automatically for smooth spectating experience.- Added convar tv_relayradio, 0 = off, 1 = relay team radio commands to GOTV (default value = 0).- Added convar tv_relaytextchat, 0 = off, 1 = relay \"say\" chat only, 2 = relay \"say\" and \"say_team\" chat to GOTV (default value = 1).- Team kills and team damage is now preserved for players in competitive games across disconnects and reconnects.- Fixed a regression in naming of tv_autorecord demo files.\t\t\n"
    },
    {
        "id": "1496587685385726340",
        "timestamp": "23 Jan, 2013",
        "link": "http://store.steampowered.com/news/9802/",
        "entry": "\r\n\t\tRelease notes for 1/23/12[ MAJOR CHANGES ]- A new game mode has been added to matchmaking and offline play: Deathmatch.- Weapon balance and recoil were adjusted with pro community input ( Thanks to J3Di, NiP, VeryGames, ESC, 4NOT, mTw, and FM TOXiC )  - In addition to global changes that affect all weapons, specific adjustments have been made to: rifles, pistols, and the P90.- Weapon purchasing changes:  - The AWP's kill reward was increased from $50 to $100.  - The Glock is now a Terrorist only weapon.  - The FiveseveN is now a CT only weapon.  - The Terrorists' molotov price has been reduced to $500. The CT's incendiary grenade remains $850.  - Note that the pistol arrangement has changed in the buymenu.- The messaging system has been converted to protobuf.  - Demos recorded with previous versions of CS:GO will not be compatible as of this update. In order to view old demos, set your 'beta' to 'demo_viewer' in the CS:GO betas property panel, in Steam. Don't forget to set it back to 'NONE' when you want to play online again.  - If you are running SourceMod on your server, you will need to update to the latest version. For details, see: http://www.sourcemod.net/index.php[ MINOR CHANGES ]- Added some performance improvements for low-end clients.- Fixed some fence materials that were allowing players to see through smoke grenades.- GOTV spectator UI will now correctly show kevlar and helmet information for players.- Avatars will now correctly load for all players when connected to a GOTV server or when watching a demo.- Added support to notify players during servers maintenance downtime.- Fixed a dedicated server exploit where community dedicated servers could masquerade as official and get players searching for official game modes connected to them (saigns.de)- Fixed a rare problem when clients matchmaking for Classic Competitive game could be stuck on green Accept screen- Fixed a rare problem when clients could connect to a Classic Competitive game and then later be disconnected for failing to accept the match.- Improved algorithm pinging whitelisted dedicated servers when searching for Classic Competitive games, pinging less addresses fixes occasional problems for some customers where address translation tables on their routers would fill up and their routers would fail to route required packets to display the green Accept screen.- Added support for mm_dedicated_search_maxping to restrict client's ping when matchmaking for Classic Competitive games. ( Matchmaking algorithm will still be prioritizing best servers to minimize ping of all party members. )- Fixed a rare server crash when bots attempted to shoot the bomb defuser.- Fixed a client crash when downloading a lot of custom assets from community servers.[ NOTES TO MAPMAKERS ]- DEATHMATCH:  - Deathmatch uses the nav mesh to create spawn points. Make sure that your nav is contained within the bounds of your map to ensure that players aren't spawned outside of it. Use map_showspawnpoints to see where spawn points were generated.  - If you want to use mapper-placed spawnpoints instead of the randomly generated ones, place an info_map_parameters in your map and set usenormalspawnsfordm (\"Use Normal Spawns in Deathmatch?) to true.- WORKSHOP:  - We're launching the private beta for workshop maps. If you're a map maker, mail csgo_sdk@list.valvesoftware.com with the subject \"Map Workshop Beta\" and your steam id in the content, with a link to maps shipped ( or maps in progress ) suitable for the Workshop.- Please use the CSGO SDK list for discussions about Deathmatch and Workshop.Thanks.\t\t\n"
    },
    {
        "id": "1496586490454864675",
        "timestamp": "9 Jan, 2013",
        "link": "http://store.steampowered.com/news/9717/",
        "entry": "\r\n\t\tRelease Notes for 1/9/2013[MISC]- Added Server Report panel. Player can use this panel to report server for things such as inappropriate content and bad performance etc.. This menu is accessible from the Pause Menu.- Improved competitive matchmaking algorithm to further reduce wait times.- Fixed 'rebuy previous' not working after the first round of rebuying.- Spawn points are now randomized every round.- Whitelisted con_filter convars for debugging.- Fixed damage taken and given not being fully reset in modes that aren't round-based.- Changing mp_warmuptime takes effect immediately.- Added concommands mp_warmup_start and mp_warmup_end, which restart and early terminate warmup, respectively.- Fixed exploit where cl_interp restrictions could be bypassed.- Alias command no longer allows aliasing over existing convars and concommands.- Fixed rare case of maps not matching requested game mode on dedicated servers- The client-side headshot feedback sound no longer plays for the local client when damaging another player in the head with a grenade explosion or when shooting them in the head through another surface (penetration)- Slightly reduced the client-side headshot feedback sound volume (spatialized sound is unaffected)- Fixed nameplate flicker in free cam mode during demo playback.- Fixed wall penetration on Linux dedicated servers- Fixed exploit where grenade projectiles were used to boost teammates.- Fixed a very rare server crash when firing a weapon.- Improved the error message shown when finding a game fails to locate an acceptable dedicated game server formerly reported as DS.- Improved memory management on servers with GOTV enabled.- Changed holiday cheer level to match CS1.6.\t\t\n"
    },
    {
        "id": "1479695995455444289",
        "timestamp": "24 Dec, 2012",
        "link": "http://store.steampowered.com/news/9678/",
        "entry": "\r\n\t\tRelease Notes for 12/24/2012[ MISC ]* Added the ability to commend and report players from the player details view that can be accessed in the scoreboard.* Number of competitive wins, and unique commendations are now shown in the main menu along with skill group.* Competitive scoreboard will show number of competitive wins needed to display your skill group if you have not displayed it yet. * Fixed movement on ladders ignoring the walk button. Now climbing ladders while holding walk is slow and silent, which fixes previous exploit of being able to climb ladders at fullspeed without making sound.* Fixed failure to fire after weapon switching away from a reload and back (fake-reloading).* Whitelisted tv_password convar to set GOTV password.* Reduced fps in main menu when not connected to a server from 300 fps to 120 fps to help with laptops and desktop video cards doing excessive work. Exposed fps_max_menu convar to control fps in main menu.* Added one more minute of grace period for players to reconnect to their competitive match before a cooldown for failing to reconnect is assigned. Cooldown for failing to reconnect is now assigned after player has remained disconnected for at least 4 minutes, not counting the round of disconnection and not counting the round in which 4 minutes grace period elapses.* Fixed Hammer crash on exit.* Added some holiday cheer.\t\t\n"
    },
    {
        "id": "1477443562801867453",
        "timestamp": "12 Dec, 2012",
        "link": "http://store.steampowered.com/news/9585/",
        "entry": "\r\n\t\tRelease Notes for 12/12/2012[ GAMEPLAY ]&nbsp-Merged elements of Volcano's DE_NUKE_VE map into standard DE_NUKE.&nbsp-In the main menus, replaced mapgroup carousel with a map picker. Players can now select which maps they want to match-make into.&nbsp-Maps in map picker show expected wait time.[ MISC ]&nbsp-Improved performance in CPU-bound cases.&nbsp-Fixed missing ladder sound when moving at full speed on ladders.&nbsp-Added support for muting microphone in play with friends lobby.&nbsp-Fixed cases where spectator UI wouldn't appear during GOTV demo playback.&nbsp-Fix for crash caused by extinguished fire.&nbsp-ESC key now closes Server Browser dialog.&nbsp-Made CHudMenu have input priority over Scaleform.&nbsp-Reduced default vgui font size for resolutions >1600.&nbsp-Whitelisted mp_match_restart_delay.&nbsp-Limiting physics timestep to 64 to eliminate high tickrate physics bugs, such as bouncing guns.&nbsp-Server no longer creates physics objects for players to reduce server cpu load. To re-enable, set cs_enable_player_physics_box to '1'.\t\t\n"
    },
    {
        "id": "1479694818687176233",
        "timestamp": "6 Dec, 2012",
        "link": "http://store.steampowered.com/news/9534/",
        "entry": "\r\n\t\tRelease Notes for 12/6/2012[ MISC ] * Added support for using '?' instead of ':' in the 'connect' concommand so we can create URL links that connect to GOTV. * Fixed case where walking on stairs generated footsteps on the client but not on the server. * Fixed damage taken console report not reporting damage taken. * The spectator UI player bars and the ammo panel will now show individual player kills for the round. * In the buy menu, FIREPOWER now reflects raw weapon DAMAGE. * The value for the 'rate' convar is no longer read from Steam registry settings. * Fixed buy menu showing the wrong values for weapon armor penetration. * Kick/bans for tk'ing and team damaging are now controlled by mp_autokick.* Fixed part of the headshot particle effect drawing through walls. * Fixed radar and overview showing enemy icons for decoys indefinitely. * Number of GOTV viewers is now correctly calculated and networked through the chain of GOTV relays. * Fixed hearing a headshot sound when an enemy is burning from your molly/incgren fire.\t\t\n"
    },
    {
        "id": "1479694159170013122",
        "timestamp": "3 Dec, 2012",
        "link": "http://store.steampowered.com/news/9498/",
        "entry": "\r\n\t\tRelease Notes for 12/3/2012[ MISC ]-&nbspIn addition to TKing, you can now be kicked/banned in two different ways for team hurting: &nbsp-&nbspFor doing an unusual amount of damage in a short amount of time. &nbsp-&nbspFor doing an excessive amount of team damage over the course of the match.-&nbspPartial inferno extinguishing now properly puts out flamelets.-&nbspMolly/Inc Grenade fire now goes out slightly faster when extinguished and updated the overall effects a bit.-&nbspFixed an edge case where the alerts panel would show on round start for a frame.-&nbspChanged default tv_delay to 10s.-&nbspChanged default tv_delaymapchange to 1. This postpones the post-match level change by the tv_delay amount to ensure that the broadcast to GOTV clients is complete. NOTE: Manually quitting the server or changing the level while the broadcast is still ongoing will kill the feed to all GOTV relays and GOTV clients and your spectators will miss the end of the match. It's best to let the system's timer run out on its own or wait for as many seconds as you have tv_delay set for.-&nbspReplaced hard-coded 'E' observer use command with '+use'-&nbspTweaked autodirector based on feedback.-&nbspAdded item purchases to server log.-&nbspDecoy grenade changes &nbsp-&nbspReduced price to $50. &nbsp-&nbspReduced fire rate and extended life span to make it less identifiable as a decoy. &nbsp-&nbspPhysically looks more like a flashbang to allow fakes.-&nbspFixed assists displaying the assister's name twice in the server log.-&nbspReduced default value of sv_clockcorrection_msecs to 30 and whitelisted the convar (thanks J3di)-&nbspReorganized net_graph options: &nbsp-&nbsp0: off &nbsp-&nbsp1: Competitively allowable data. &nbsp-&nbsp2: Additional In/Out data. &nbsp-&nbsp3: Additional real-time graphing.-&nbspAdded net_graph to convars restricted by sv_competitive_minspec ( allowable values are 0 and 1 )-&nbspValve can now assign official violations cooldown to accounts-&nbspAdded a game server convar sv_kick_players_with_cooldown (default=1) &nbsp-&nbsp0: allow all players to play on game server &nbsp-&nbsp1: kick players with official assigned violation &nbsp-&nbsp2: kick players with any competitive cooldown\t\t\n"
    },
    {
        "id": "1514595968509711476",
        "timestamp": "16 Nov, 2012",
        "link": "http://store.steampowered.com/news/9408/",
        "entry": "\r\n\t\tRelease Notes for 11/16/2012[ MISC ]-&nbspEliminated the vignette effect from the scoreboard.-&nbspScoreboard has been narrowed.-&nbspSmoke grenade visibility on the edges of smokes has been adjusted to obscure vision less.-&nbspImproved some cases of particle sorting between smoke and molotovs and other particle systems.-&nbspAdjusted the loser bonus for Terrorists when time has run out. Surviving Terrorists get no income, but dead teammates receive a normal payout.-&nbspRemoved match start and round end info panel animation sfx.\t\t\n"
    },
    {
        "id": "1514595904004178578",
        "timestamp": "15 Nov, 2012",
        "link": "http://store.steampowered.com/news/9392/",
        "entry": "\r\n\t\tRelease Notes for 11/15/2012[ GOTV ]-&nbspAs a GOTV client spectator, the flangbang effect from first person is now reduced a bit and there is now text that says \"(BLINDED)\"-&nbspFixed overhead targetIDs not showing sometimes when spectating with XRay mode on.-&nbspAdded a convar \"cl_teamid_overhead_maxdist_spec\" that can set the max distance overhead TargetIDs will show up when spectating-&nbspChanged player target selection input from hardcoded number keys to keys bound to \"slotN\" commands.-&nbspChanged X-Ray toggle key from hardcoded 'X' to whatever is bound for \"radio2\", which defaults to 'X'.-&nbspFixed health/armor/ammo of the spectated target not being displayed as a GOTV client.-&nbspMade bomb visible in GOTV clients' map overview at all times.-&nbspFixed money not showing up in GOTV scoreboard for either teams.-&nbspFixed flashbang effect flash retriggering when changing spectator target.-&nbspFixed missing winpanel when GOTV spectating.-&nbspRevised GOTV autodirector behavior.[ MISC ]-&nbspRepacked content to reduce CS:GO disk usage from 6GB to 4.8GB.-&nbspImplemented separate sound for distant grenade explosions to make the distance easier to gauge. Sound crossfades near and distance sound between 800 and 2800 units.-&nbspReduced audible distance of scope zoom.-&nbspFire devices have been modified ( Molotovs and incendiary grenades ): &nbsp-&nbspFire can now be extinguished by smoke grenades and deployed smokes now deny fire device detonation and spreading. &nbsp-&nbspFire now spreads a bit faster and not quite as far. &nbsp-&nbspFire \"tagging\" slowdown has been removed. &nbsp-&nbspAdjusted fire armor penetration value.-&nbspFixed Terrorists getting loser bonus payout for running down the clock. Now Terrorists get no income if the round timer runs out.-&nbspArmor Penetration is now shown for weapons in the buy menu.-&nbsp3rd person and first person default duck speed has been slightly increased.-&nbspTapping the duck key frequently in short intervals will cause your duck to slow, but cools down very fast.-&nbspSmoke grenade visibility inside a smoke has been reduced to give less advantage to players inside and more to players outside.-&nbspDesign changes for Scoreboard &nbsp-&nbspAdded team names to scoreboard. &nbsp-&nbspMade score more prominent. &nbsp-&nbspWin banner states are now team specific.-&nbspDesign change for win panel and alert messages.-&nbspServer log changes: &nbsp-&nbspAdded xyz coordinates to messages. &nbsp-&nbspAdded nade messages. &nbsp-&nbspAdded team change messages. &nbsp-&nbspAdded 'assist' messages.-&nbspFixed a case of loss of mouse and keyboard input.-&nbspServer browser filter settings are now saved.-&nbspBig Picture Support &nbsp-&nbspFixed not being able to dismiss server browser dialog with controller. &nbsp-&nbspAdded ability to disable all controllers.Thanks to the following for input on the balance changes:NiP, Ubinited, Team ALTERNATE, Area51, Mousesports, Anexis, FM.TOXiC, VeryGames, RegnaM.\t\t\n"
    },
    {
        "id": "1514593982770508891",
        "timestamp": "30 Oct, 2012",
        "link": "http://store.steampowered.com/news/9243/",
        "entry": "\r\n\t\tRelease Notes for 10/30/2012[ MINOR FIXES ]- GOTV relays now support up to 255 spectators per relay.- Fixed a crash when connecting to a GOTV relay.- Fixed tv_relaypassword.- Added GOTV viewer count to the scoreboard.- Improved highlighting of selected player for spectator.- Fixed call vote panel showing an uninitialized button in some cases.\t\t\n"
    },
    {
        "id": "1514593982631861397",
        "timestamp": "25 Oct, 2012",
        "link": "http://store.steampowered.com/news/9207/",
        "entry": "\r\n\t\tRelease Notes for 10/25/2012[ SPECTATING ]-&nbspResurrected SourceTV as 'GOTV.'-&nbspAdded a map overview that displays players, events, grenade detonations, etc. Can be drawn on in a select-able colored pen when spectating or if the \"sv_competitive_official_5v5\" convar is set to 1 on the server or if the client convar \"mapoverview_allow_client_draw\" is set on the client (drawings are not currently networked to other players).-&nbspAdded free camera to spectator modes cycle.clamped hud_scaling to 0.95.-&nbspAdded convar 'cl_spec_show_bindings' that toggles the visibility of the spectator key bindings.-&nbspAdded spectator ability to toggle competitive scoreboard player data using the 'drop' command.-&nbspExtended team clan name support to the Team Select Screen. To use team clan name, all humans should match their Team name in Games->Settings, or the server admin can use the 'mp_teamname_1' and 'mp_teamname_2 convars.'-&nbspAfter halftime, teams no longer switch sides visually on the spectator screen, they now stay where they are and the team colors switch instead.-&nbspCreated a server convar that lets you swap the default player side position manually (CTs on right and T's on left) called mp_spec_swapplayersides.-&nbspMade the hotkey that's assigned to jump to a player not change after half-time.-&nbspYou can now display a country flag next to your custom team name on the spectator scoreboard by setting \"mp_teamflag_1/2\" to ISO Alpha-2 country code of the country you want to display.[ CLASSIC COMPETITIVE ]-&nbspIntroduced \"Skill Groups\", the new Skill Group emblems are now visible in the main menu and at the end of a competitive match. A players' Skill Group will be displayed after they achieve at least 10 competitive match wins.-&nbspReworked conditions of valid match leaving: A vote to concede becomes available to the team that lost a player. Otherwise the match continues.-&nbspNumber of players searching for a competitive match will display number of players compatible with the game type selected by player, for example players searching for \"Dust II\" will see a number of players searching for \"Dust II\" + \"Defuse Mission\", players searching for \"Defuse Mission\" will see sum of all players searching for \"Defuse Mission\" or any specific defuse map, and so on.-&nbspEstimated wait time for a competitive match now more accurately displays wait time based on the game type selected by player.[ SERVER ADMINISTRATION ]-&nbspAdded Save/Restore of match state.  &nbsp-   Added convar 'mp_backup_round_file [fileprefix]' -- If set then server will save all played rounds information to files with this prefix. Backup file contains players information like KDA, MVPs, cash, kevlar, helmet, defuse kit, weapons and grenades and match score for first and second halves. In a case of a tournament server crash backup file can be loaded using ' mp_backup_restore_load_file'. The default is 'backup'  &nbsp-   Added convar 'mp_backup_round_file_last' -- Every time a backup file is written the value of this convar gets updated to hold the name of the backup file.      -Added concommand 'mp_backup_restore_list_files [number]' -- Lists recent backup round files matching the prefix, most recent files first, accepts a numeric parameter to limit the number of files displayed (default 5).  &nbsp-   Added concommand 'mp_backup_restore_load_file [filename]' -- Loads the specified backup file and applies players information like KDA, MVPs, cash, kevlar, helmet, defuse kit, weapons and grenades; sets the match score for first and second half and starts next round.  &nbsp-   Added convar 'mp_backup_round_file_pattern,' that defines the pattern for naming backup files using tokens. Example: %prefix%_%date%_%time%_%team1%_%team2%_%map%_round%round%_score_%score1%_%score2%.txt. The default pattern results in 'backup_roundNN.txt'-&nbspWhitelisted 'mp_logdetail' convar.-&nbspAdded convar 'sv_damage_print_enable', that determines whether damage given and received is visible in the console after a player is killed.-&nbspAdded 'cl_bobcycle' to 'sv_competitive_minspec'. It's now restricted to the defauklt 0.98 on servers that have 'sv_competitive_minspec' enabled.-&nbspMade all server cash_ convars notify players when they are changed.-&nbspServers running with sv_pausable 1 will now correctly display 'server paused' UI element on clients when server is paused using 'pause' command.-&nbspAdded mp_spectators_max convar to control how many spectators are allowed in a match.-&nbspAdded convar mp_halftime_pausetimer that will indefinitely pause the halftime timer.-&nbspAdded convar mp_warmup_pausetimer that will pause the warmup period indefinitely. *Warmup periods shorter than 6 seconds cannot be paused.[ PERFORMANCE ]-&nbspPerformance improvements for users running on AMD systems.-&nbspFixed a major performance problem for users running Bitdefender antivirus software.[ BUG FIXES ]-&nbspFixed two crashes that could happen if you were on a team and went to spectator team.-&nbspFixed the timer display on the hud still showing even when the bomb was planted.-&nbspFixed avatar scaling issues on the spectator hud as well as the issues that would place the player slot avatars offset some distance from where they should be.-&nbspMade some adjustments to the specttor UI and regular hud to account for hud_scaling set really high.Fixed a really bad bug where going from the lobby to a game could prevent players from having input. This would result in not being able to select a team or move around.-&nbspChanged flashbang visual effect in Spectator mode so that it is updated when the target changes.\t\t\n"
    },
    {
        "id": "1515718446150841666",
        "timestamp": "11 Oct, 2012",
        "link": "http://store.steampowered.com/news/9066/",
        "entry": "\r\n\t\tRelease notes for 10/11/2012[ Minor Fixes ]-Fixed bomb defusal resetting when a server lags below 20fps.-Fixed a case where the round and timer were not being updated when spectating.-Fixed another case where warmup alerts panel didn't show for late joiners.-Fixed a crash that would happen when you died that associated with the spectator panel.-Fixed general scaleform crashes.-Made radio commands also selectable via the keypad numbers.-Fixed enemies on radar that were above/below you showing their up/down indicators rotated.-Made alive/dead state on the spectator UI easier to read.-Replaced mp_teamname_t and mp_teamname_ct with mp_teamname_1 and mp_teamname_2 to disambiguate convars from sides in a mode that supports team switching at halftime. Now the names follow the teams after the switch. ( mp_teamname_1 is the team that first plays CT ).-Changed spectator HUD to show which primary weapon each player has purchased during freeze time.-Made spectator HUD show all grenades carried by each player.[ Classic Competitive Changes ]-Added an explanation about competitive mode rules to better explain its difference from other modes.-Added save/restore of cash for competitive matches: When a player disconnects and reconnects in competitive mode, their pre-disconnect money will now be preserved.-Added a button requiring players to ready-up when a competitive match is found. When all 10 players ready-up then the matchmaking servers lock them in for the match. Abandoning at any point after clicking the ACCEPT button will result in Competitive cooldown.-Increased competitive cooldowns to 30 minutes for first offense, 2 hours for second offense and so on.-Kicking a player no longer offers a vote to continue. The game will proceed with a bot in place of the kicked player.\t\t\n"
    },
    {
        "id": "1515717886803749435",
        "timestamp": "5 Oct, 2012",
        "link": "http://store.steampowered.com/news/9033/",
        "entry": "\r\n\t\t[ Minor Fixes ]* All information required to reconnect to a competitive match is now also saved to a file on disk so that disconnected players could reconnect sooner to their ongoing game on the official dedicated game server even before connectivity with matchmaking servers is established.* Increased grace period for disconnected players to 3 minutes.* Message that refers to disconnected player now uses player's name rather than the generic term 'player.'* Fixed the alerts panel not showing alerts consistently* Made vote panel display whether you voted yes or no as well as flash each choice as people vote* If a vote is team only (like a 'kick') then the other team will now see that a vote is in progress.\t\t\n"
    },
    {
        "id": "1515717886756820211",
        "timestamp": "3 Oct, 2012",
        "link": "http://store.steampowered.com/news/8998/",
        "entry": "\r\n\t\tRelease Notes for 10/3/2012[ Minor Fixes ]Matchmaking-Added a vote to continue playing competitive match with bots after a human player abandons the match, unanimous agreement of remaining human players is required to continue playing with bots.-Reduced time required for confirming match when searching for competitive players and servers.-Improved overall search times in competitive queue mode.-Added a client message when the wamup period ends.-Extended competitive match warmup period to 90 seconds.-Message of the day will automatically dismiss itself when competitive match starts.-Added an explanation to competitive cooldown timer for clients.-Added a condition to apply competitive cooldown to players who have disconnected from the match.-Implemented scaling cooldown periods for repeat incidences.Vertigo-Rearranged props below the boost-up ladder to prevent players jumping onto the ladder without boosting-Clipped off various tiny ledges-Made small props protruding from walls non-solid-Fixed visible nodraw in ceiling holeMisc-Fixed a long standing bug where you could lose mouse input when you got to the team select screen.-Fixed a bug where the color correction during freeze time did not account for the players also being invulnerable during the new warmup - this fixed the CC gap at the start.-Fixed some bugs relating to the warmup notification not reliably showing for late joiners.-The chat now displays when the warmup has ended, just like when it is in progress.\t\t\n"
    },
    {
        "id": "1515715911424885499",
        "timestamp": "14 Sep, 2012",
        "link": "http://store.steampowered.com/news/8855/",
        "entry": "\r\n\t\tRelease Notes for 9/14/2012[ GAME ]- Added third-person gunshot flinch reaction animations for all players- Molotovs and incendiary grenades now explode in mid air if they haven't touched the ground after a small amount of time has passed- Molotovs and incendiary grenades now no longer throw shorter than the other grenade types- Fixed grenades bouncing really high if you threw them straight at the ground- Fixed grenades that don't have a timer (like the smoke) not detonating if they found a spot to continually bounce and not touch what was considered \"the ground\"- Fixed a bug in bullet penetration where a bullet would penetrate walls much thicker than intended when the first brush the bullet hit was a detail brush.- Fixed a rare case when server reservation would not load correct map on official servers- Flipped MP7 viewmodel fire selector from safety to full-auto[ UI ]- Fixed spectator glows not updating state often enough which could allow glows to show at the wrong time- Fixed player target ID names not showing properly in some cases when observing/spectating- Fixed the spectator UI showing in Arms Race- Fixed player not auto observing their killer after the death camera if no bot was available to take over- Fixed round in spectator screen not updating if you connected mid round- If all players on a team share the same team tag, the scoreboard and spectator team names will display the players' team name (steam group name)- Improved rendering performance of text UI elements[ COMMUNITY ]- Added default loading screen for direct connects and custom maps that shows loading progress- Fixed server console say command to deliver text to all connected clients- sv_password can now be set on community dedicated servers when they have no players connected and will be enforced.- Matchmaking: blocking relationships do not prevent direct server joins, they only filter during matchmaking- sv_pure: VPK files contain the necessary hashes so the dedicated servers do not need to compute them at startup but can be checked with the command “sv_pure_checkvpk”\t\t\n"
    },
    {
        "id": "1514588200430033685",
        "timestamp": "23 Aug, 2012",
        "link": "http://store.steampowered.com/news/8715/",
        "entry": "\r\n\t\tRelease notes for 8/23 Update[ Gameplay ]- Exposed a classic dynamic crosshair style in the options that represents the weapons spread accurately.- Implemented first person client flinching. Now a player gets aim punched a bit when shot. The amount is based on the damage.- Increased amount of tagging that results from hits.[ Bugs ]- Fixed the scoreboard turning toggleable in the end match state.- fixed not being able to bring up the pause menu without dismissing the scoreboard in the end match state.- Parallelized matchmaking results analysis process and reduced time game takes to perform matchmaking.- Improved matchmaking algorithm giving more weight to dedicated servers ping during matchmaking results analysis.[ Community ]- Removed the implicit dependency on round-limited matches so servers that want to use mp_timelimit instead can. Mp_timelimit is used only if mp_maxrounds is set to 0.- Exposed mp_forcecamera convar.- Exposed set of server hibernate convars.- Fixed code that was preventing mapper-placed weapons.\t\t\n"
    },
    {
        "id": "1514587717827022043",
        "timestamp": "22 Aug, 2012",
        "link": "http://store.steampowered.com/news/8702/",
        "entry": "\r\n\t\tRelease notes for 8/22 Update- Addressed some stability issues. - Fixed perf issues when logging is enabled.- Added a convar (cl_crosshairgap) to control the gap of the classic crosshair.- The smoke grenade smoke is now taller so it's now more useful to use it to block places like double-doors in dust2.- Players can no longer interrupt another player defusing the bomb by standing in between them and the bomb.- Disabled sv_pure on listen servers.- Fixed an sv_pure bug that resulted in false inconsistent MD5s- Increased search iterations and time delay for keeping sessions in the ignored pool. mm_ignored_sessions_reset can now reset the ignored pool.- Fixed a case where MOTD prevents input to the team select screen.- Fixed occasional \"server is full\" error when matchmaking into classic casual games.- Fixed an exploit where a vote could be called for an invalid map.- added some sound mix settings suggested by pros- increased the volume of bullet impacts and ricochets- increased the volume of 3rd person footsteps- increased the volume of weapon foley sounds (reloads, etc.)-decreased the volume of ambient soundslinux- Added steamcmd support to srcds_run. In order to have srcds_run auto-update when the CS:GO dedicated servers get patched, the srcds_run script must be run with the following options: -autoupdate -steam_dir STEAMDIR -steamcmd_script STEAMSCRIPT        where STEAMDIR is the directory to the steamcmd dir ( example: ~/Steam/ )        where STEAMSCRIPT is the name of the script that steamcmd should execute ( example: ~/Steam/csgo.txt )        For information on how to create a script for steamcmd, see https://developer.valvesoftware.com/wiki/Counter-   Strike:_Global_Offensive_Dedicated_Servers#Automating_SteamCmd\t\t\n"
    },
    {
        "id": "1514587717776386800",
        "timestamp": "20 Aug, 2012",
        "link": "http://store.steampowered.com/news/8677/",
        "entry": "\r\n\t\tRelease notes for 8/20 UpdateGameplay:• Added the Weapons Course to the game.UI:• Voice notification can now show more players talking.• Updated the freeze panel to no longer show the heath for your killer in competitive mode.• Added an option in the menu to disable the game instructor messages.• Update to the player info panel to no longer show achievement alerts.• Update to the leaderboard screen to default to “Friends” filter.• Added the “Total Games Played” leaderboard category.• Updated the Play With Friends screen:-- Made the chat window bigger so text is no longer cut off.-- Adjusted the size of dimming when the focus changes between friends list and lobby list.  It used to obscure the friends list and a little of the chat. Now it only obscures the friends list.Bug Fixes:• Updated the radio command panel so that the radio panel doesn't end up at the top of the screen during a mode that doesn't have a money panel.• Set Classic Casual deadtalk to 0 to encourage fair play.• Fixed the freeze panel dynamic positioning that would allow it to go too high.• Fixed a missing text string displayed when player is not connected to Steam in leaderboards.• Fixed a bug where the Mag7 could be bought by Ts via console commands.• Fixed a bug where adding favorite server was not functional in the Community Server UI.• Fixed a bug in the Play With Friends lobby where using left and right on keyboard or gamepad made the screen unresponsive.• Fixed a bug in the Play With Friends lobby where typing in the Chat window would cause player names to flicker in the friends list.• Fix for voice/chat/radio messages. Better unified the handling of voice and chat messages. -- Chat messages now correctly use sv_allchat (instead of sv_alltalk), which should be more consistent with other source games. -- Team-only communications now are not affected by sv_allchat/sv_alltalk, which means that private communications to one's team stay private, regardless of game mode. -- Team-only communication is also not overridden by sv_full_alltalk, which allows teams to privately communicate strategy during warmup time and intermission. -- Radio commands are considered team-only, so these should still be usable for tactics during games with sv_alltalk enabled (e.g. casual). -- Spectators no longer hear team-only communications, except when sv_spec_hear is mode 2 (hear/see comms of the spectated teams).Audio:• Increased the audible range of the c4 plant and disarm sounds.• Fixed audio randomly chirping/screeching on certain levels.Matchmaking:• Tuned lobby distance computations when performing matchmaking.• Exposed a convar (\"mm_csgo_community_search_players_min\") for community quick match to look for community servers having at least specified number of human players already playing.Community:• Shipped zombie model to support the Zombie Mod\t\t\n"
    },
    {
        "id": "1514587476561906698",
        "timestamp": "15 Aug, 2012",
        "link": "http://store.steampowered.com/news/8657/",
        "entry": "\r\n\t\tRelease notes for 8/15 Update:UI:• Added Message of the Day• Added a message when running without Steam to inform the users that the game requires Steam to be running. • Added support for radar user message breaking up into several messages to allow for servers with large playercounts to not break user message stream when encountering too many entities.• Updated the scoreboard so that if a game has a max of ten players you will see a compact scoreboard.• Update to HUD voice status - darkened chat background from 32% opaque to 45% to increase readability of messages.• Leaderboards input device filter now defaults to mouse and keyboard.Bug Fixes:• Fixed a bug where a dash was displayed when there was no score in the scoreboard.• Fixed an issue with the HUD scaling not working with some elements.• Enabled controller sampling regardless of input lock.• Fixed several vgui fonts being too large at larger resolutions.• Ignore low violence registry settings for CS:GO since we have no low violence regions.• Fixed winning text not getting updated for arms race.• Fixed win panel misalignments.• Updated the scoreboard to fill from top to bottom for the order of players joining.• Updated the scoreboard - moved the nav buttons up when you play with 10 players.  Added a more opaque background.Community Support:• Added convars for better server customization:o mp_solid_teammates - Determines whether teammates are solid or not.o mp_free_armor - Determines whether armor and helmet are given automatically.o mp_weapons_allow_zeus - Determines whether the Zeus is purchasable or not.o mp_halftime - Determines whether or not the match has a team-swapping halftime event.• Omitted reference to ranking or matchmaking from button warning.\t\t\n"
    },
    {
        "id": "1533727235377740996",
        "timestamp": "14 Aug, 2012",
        "link": "http://store.steampowered.com/news/8641/",
        "entry": "\r\n\t\tRelease notes for 8/14 UpdateGameplay:• Addressed recently reported performance issues.• Living players can now hear the dead spectators in Casual game mode.Effects:• Improved muzzle flash dynamic light performace and optimized bullet hit impacts effectsUI:• Added options to select the position of the steam toast notification.• Fixed an issue with the Scoreboard where it was not showing a Tie or Loss properly.• Fixed an issue where players were not getting updated in the Mini-Scoreboard.• The Money HUD element now flashes more when it increases.• The Scoreboard now allows you to view a player's profile.• Updated the Alerts and Win panel spacing to match each other better.• Updated the Win panel to be overall smaller and streamlined in all the states for modes.Bug Fixes:• Fixed an issue in the HUD player count where players who left or changed state quickly were not getting updated in the scoreboard as such.• Updated the Play With Friends screen to enable the private/public toggle.• Boot invites should now be accepted after the game loads from an invite click in steam message.• Fixed description text for the Achievement: “Awardist”.• Fixed server crash caused by taking environment (falling) damage while defusing.• Fix for firing delay after weapon switching during a reload.• Fix for cash awards not be applied properly for grenade kills.Matchmaking:• By default the input device is locked to keyboard and mouse.Community Support:• Fixed a bug where custom server map lists wouldn't populate if CT models weren’t specified.  Server now sends information about slots, models, arms and maplist before serverinfo so that correct models could be loaded.• When hashing the community server response we take into account game mode/type/numslots so that we rebuild extended kv when mode changes, but the map remains the same.• Added commandline argument \"-maxplayers_override\" that, if exists, trumps any “maxplayers” values read from gamemodes files.• Added -gamemodes_serverfile command line parameter that allows specifying a file other than the default gamemodes_server.txt• Network stringtables will not be using dictionaries on community servers even if convar is enabled. This allows clients to actually download map since resources are referenced by strings and the client will not have the dictionary until they have the map.• Client will defer .bsp file preload until after required resources are available. For the case of a missing map, this allows the client to reach signon state \"new\" and kick off downloader thread while retaining their spot on the server.  This allows community servers to essentially run 3rd party maps that clients will download when played.\t\t\n"
    },
    {
        "id": "1533727235280879205",
        "timestamp": "10 Aug, 2012",
        "link": "http://store.steampowered.com/news/8614/",
        "entry": "\r\n\t\tGameplay:• Update to bot aiming system. Players should see a substantial decrease in the ability of bots to get perfect shots on moving targets, especially at lower difficulty levels. Bots now can react poorly (or well) to enemies that are dodging/strafing, and also must now account for their own movement while shooting.• Moved the setting of maxplayer from maps to modes in gamemodes.txt.• Increased Casual money rewards, per Beta feedback.• The difficulty of the upper tier bots has been increased.• Updating movement values to community vetted numbers.  Thanks Wombo!Weapons:• The max penetration distance has been increased to 7.5 feet.• Increased recoil of the AK-47.• Slightly lowered recoil and increased accuracy of the Famas.• Increased armor penetration and increased damage of the MP7.• Increased damage and increased movement speed of the SSG08.• Decreased accuracy of the Tec-9.• Increased damage of the UMP45.• Fixed the “quick switch exploit” that allowed players to bypass slow weapon cycle times by switching weapons.• Increased the duration of the AWP deploy animation to 1.25 seconds.• Reduced the strength of the flashbang.• Berettas no longer shift horizontally when their accuracy changes.• The SSG08 texture has been updated.• Added rumble effect to knife.• Fixed grenades becoming stuck on players or inside them when thrown from within a player volume.• Changed grenades to bounce more realistically off of players.• Players should no longer be able to boost off of grenades.• Reduced the opacity core radius for player standing inside a smoke grenade.Animations:• Updated the AWP viewmodel firing animation.  This was inspired by community feedback that suggested more towards-the-viewer recoil and less vertical recoil.• Added some recoil to the SSG08 rifle viewmodel firing animation.• Updated the 3rd person CT firing pose for SSG08. This fixes major shoulder and elbow popping, minor forearm popping on transition between firing and idle while crouched.• Updated the following viewmodel firing animations: -- Berettas -- AK-47 -- M4A4 -- Desert Eagle -- Galil ARUI:• Added full screen windowed mode to video options.• Removed Quick Match from the Play Menu.• Updates have been made to the Vote UI: -- The vote thumbs and counts now also display on the vote result, so you get a summary of why it passed or failed. -- Now when a vote fails because it was cast recently, we show that warning message before we would show the failure for an individual voter recently casting a failed vote. -- Fixed the result numbers sometimes not showing the very last vote that caused it to succeed or fail. -- The player list is now scrollable when there are more than 10 selectable players. -- Added a new convar - \"sv_arms_race_vote_to_restart_disallowed_after\" that should be set to the weapon level after which no restart match vote will be accepted.  This convar is currently set in GameModes.txt for each of the modes of play, and is set so that a vote to restart will work until someone reaches the knife level.• Updated the text for the Loading screen hints.• Updated weapon grind achievement descriptions to match their new values.• Now when you drop a weapon voluntarily, a message pops up letting you know it was dropped.• A message stating you cannot drop an item will now display when you try to drop non-droppable items.• Armor and helmet icons have been updated.• Updated the hit area for menu buttons that prevents the buttons from flickering between up and over states when cursor is near the left edge of the button.• Updates have been made to the Warmup panel: -- The Warmup panel never comes up if it doesn't have a value to fill out the number. -- The Warmup panel now properly clears when the UI clears it, so it knows to come back up again when necessary.• Offline with Bots match set up screen now uses different icons for \"Random\" map groups based on the chosen game mode (Arms Race, Demolition or Classic).  • Updated the Options menu to use wider text fields.• Updated the T icon.• Update to the options screen slider control: -- You can now double click the box to select the whole number string. -- You can now put your cursor in the middle of a block of numbers to start editing it in the middle. -- When you are sliding the bar, the number will update as expected.  -- Improved the highlight in the Achievements screen. -- Added ability to page through the categories in the Achievements screen using Page Up and Page Down keys.• Scoreboard improvements: -- Updated the Win Banner to be more in line with rest of UI. -- Added highlight for player selecting. -- Added mute icon. -- Added a Team Switch icon. -- Generalized the \"dead\" visual state in the scoreboard so the row is dimmed regardless of whatever other states that player is in (previously it wouldn't dim if for example, you were also dominating that player and they were dead) -- Updated the Vote panel UI to use checkbox/x iconography instead of the thumbs up/down. -- The radar maps were updated for the SE versions of Aztec, Dust 2 and Nuke. -- The Terrorist Buy Zone indicator on the radar image for Dust2 and Dust2 SE has been updated. -- The opening upfront movie art has been updated. -- Added a Join Game Button to the Play With Friends Lobby. -- Increased the font size on Vote result panel. -- Brightened the player outline in the Mini-Scoreboard.  -- The Match Set Up screen now hides the arrows in the map navigation panel when the current game mode includes maps or map groups with only one map. -- Fixed issues with the Recently Unlocked Awards. -- The Recently Unlocked Awards panel now uses a time window (currently 5 days) to determine which Achievements to display.  -- “Screen Resize” is now labeled as “HUD Resize” in the Advanced Video Settings screen. -- Fullscreen menu screens now have animating background and foreground elements. -- The ‘Team Full’ messages on the Choose Team screen now display longer. -- Spectators will no longer see “Your Team Lost” in the Scoreboard.  -- Radio commands are now updated for the new audio commands. -- Overhead alert icon is brighter, a bit more saturated and easier to see. -- Removed \"Play Distance\" option from the menu and replaced it with HUD scaling bar and viewmodel display position default. -- Added a key bind to ‘Start a Vote’. -- Moved Viewmodel settings to the Game Settings menu. -- Removed delay on death notices. -- Updated colors and bg for readability. -- Increased number of death notices to seven total and made them stick around a tad longer. -- Increased the number of characters before truncating in the death message. -- Player clan name is now shown in the death message and id's panels. -- Updated Achievement chat colors to current scheme. -- Tweaked death message colors again to bring them closer in line with others.• Scoreboard update -- Now accommodates 24 players. -- Scoreboard no longer hides all other UI elements. -- Fixed Z order for a variety of panels which now allows the chat to draw on top of the scoreboard. -- MVP stars are now broken out in the scoreboard. -- Added ping column. -- Added dollar signs to the scoreboard elements that are represented in dollars. -- Fixed other players showing your local clan tag on their target id name. -- The server name now shows in the scoreboard. -- Showing Elo brackets in scoreboard for casual mode. -- Added Cost per Kill column to the scoreboard.• Added Community Quick-Play button to PLAY sub menu.• Made HUD team color adjustments to make them more uniform.• Created an additional function to set team colors for \"additive\" drawing because different HUD elements used the same color values, but rendered them differently.• Fixed the chat panel to more-or-less match the position of the voice/info panel.• Added the Community Server Browser to the Ingame menu under the title \"Browse Community Servers\" • Added a content warning message before displaying Server Browser.• Chat UI update: -- Made the in-game chat window smaller.  -- Fixed the scroll bar on the ingame chat. -- Chat input UI now makes a sound when too many characters have been typed. -- Updated the max number of characters to be1024. -- Allow numpad ENTER key to close the chat window.• Added keybindings to ‘Autobuy’ and ‘Rebuy Previou’s.• Shortened binding label “ESCAPE” to “ESC”.• Added keybinding to buy menu's 'CLOSE'.• Added the ‘Dust Mission’ to the match set up carousel. • The mini scoreboard now supports more than 10 players.• The mini scoreboard now uses the server's num players instead of being hard coded.• Modified scrollable player/map list in \"Call Vote\" panel.• Made scrolling thumbs bigger.• Modified scrollbar buttons to be more like standard buttons.• Update to Choose Team screen: -- Screen can now show up to 24 players. -- Added names to the avatars on the team select screen.• Fixed the radio panel to position correctly under the money panel again, but will never overlap the health panel regardless of screen res or safezone settings.Maps:• A collision model update has been made to props on all maps.• Aztec -- Reduced foliage prop popping. -- Refined area for the bomb zone area graphic indicators on the radar map. -- Added collision at the bombsite to prevent bomb falling into a crack in the geometry. -- Fixed some terrain seams near bomb site B. -- The planking on scaffolding has been moved so it is no longer a navigation hazard. A physics clip has been added to the upper planks to prevent bomb from being trapped there. -- The Nav mesh has been updated. -- Clipped off microledge on T side of double doors.• Shoots -- Adjusted collision to allow players to jump cleanly thru windows. -- Clipped the space behind sandbags on center platform.• Baggage -- Moved spawn points back against wall to help prevent spawn camping. -- Allowed for random spawning between all 20 possible spawn locations. -- Removed a floating bottle prop.• Dust -- Fixed a tight collision spot above the van in the tunnel. -- Updated the pillar model.• Dust 2 -- \"Tunnel Stairs\" is now “Long Doors” -- Refined Radar Map Bomb sites A and B image locators. -- Fixed a collision problem at the scaffolding by bombsite A.  -- Updated the pillar model. -- Extended fade distance on mid-barrels to prevent double door snipers from seeing through them. Thanks, VeryGames.• Bank -- Players can now crouch jump through the drive thru window of the bank building. -- Bullet decals now work on the interior surfaces of the safe.• Inferno -- Fixed a bug where a tree was growing out of a trash pile texture near Logs. -- Fixed a bug where a Bot with the bomb is unable to get out of the fountain at bombsite B. • Italy -- Tuned the Nav mesh. Fixed several jump-over-fence issues and the big issue with bots not navigating down from the hostage balcony. -- Changed Italy wine pallet collision type to cardboard.• Office -- Fixed the harsh lighting glitch in Garage near Back Way. -- Fixed the Bots getting stuck when traveling over counter tops. -- Moved the ashtray back into a corner which should fix an issue with the hostages getting stuck when exiting the building.• Nuke -- Updated the language on the radiation warning signs. Changed 'radioactiv' to 'radioaktiv!' and 'Kein Zutritt' to 'Kein Zutritt!' -- Updated the Forklift prop.• Train -- Fixed some missing ladder Nav areas to help bots climb up on ends of flatcars. -- Added new ladders to sides of bombsite train cars, adjusted biohazard straps to not be in the way of the middle of the cars. The bomb should now be plantable and defusable in the middle of each car.• Shorttrain -- Cleaned up Nav mesh. Deleted orphan areas, fixed bad jumps, fixed stale Nav mesh over missing geometry, and made tops of trains \"avoid\" areas. -- Fixed a bomb placement bug on shorttrain.  -- Added ladders to the middle of each side of the flatcars, added ladder markup, and moved struts out of the way.  -- Fixed weird geometry that was floating in mid-air on the flatcar model.Audio:• New Voice Overs added for Terrorist and Counter-Terrorist units.• Fixed the looping ambience for Lake. • Players grabbing a hostage, planting a bomb, defusing a bomb, and players close to a bomb that is about to explode now all say something over the radio informing their team of what's happening.• Player now brags over the radio when he's dominating someone.• Players now cheers over the radio when the win scoreboard is up when the match is won by his team.• Fixed a bug in the exponential panning mode.• Added snd_headphone_pan_mode and snd_speaker_pan_mode convars that specify using 0 = exponential, 1 = equal power, 2 = GoldSrc (trigonometric) for both headphone and speaker monitoring situations. This differentiation is important for setting system defaults and we may even consider differentiating surround circumstances as the speaker positioning does.• Split front/rear speaker position options for stereo versus surround. In CS:GO, stereo speaker configurations are going to want the broadest range of positional data, whereas surround systems should default to 45 degree corners, which gives both resolution and sensitivity. Adding these was largely so we can supply the best default settings possible.• Default panning method is now based (again) on an exponential curve but with an adjusted 1.22 exponent. This not only makes for less inter-speaker blurring but was determined to be the flattest xfade response in decibel level testing. Equal power remains as an option.• New convar options have reasonable doc strings.• Added snd_speaker/headphone_pan_radial_weight, which applies the \"GldSrc\" stil cosine weighting but weighted by this float convar. this allows for 1.6 style side weighting but with the exponential center weight allowed by exponential mode.• Removed all dsp from first person weapon sounds.• Added burn damage sound entry start operator to block subsequent damage sound for 1.0 seconds.• Crossfade from \"near\" gunfire to \"distant\" gunfire is now smooth, fixing the bug wherein distant sounds first got quieter then louder the further they were from the listener -- Added exponential function to the \"near\" / \"distant\" crossfade operators. -- \"distant\" weapon fire mix group has been increased significantly to offset the reduction in decibel levels.• Added \"pow\" function to math operator to facilitate non-linear crossfades in operator stacks.• Added a parameter that discounts \"player sound\" status when determining the distance of a sound that is currently hardcoded into the operators system (\"source 1\" legacy).. \"force_not_player_sound\"• Changed all of the new sounds spatialization options to use the following denial test if(sv.IsActive() && !sv_cheats.GetBool()) -- This prevents players from changing their settings during a non-cheat enabled game but allows them to tweak them during a cheat enabled game.• Fixed a bug that was always playing the AK47 sounds from the same location• Famas - lengthened sound to smooth the 3 shot burst• Small edit to the ak47_shoot, rate at beginning of wave lengthened and pitch slightly lowered in this area as well.• Re-authored the footsteps to increase clarity and remove mush, they are also louder and now more distinct within the world.Effects• Fixed a bug with the weapon shell eject effect. The highest-quality level of the effect (which usually accounted for the first three shots fired in a sequence) was using some complicated stuff for the shell bounce that was inadvertently sending the shell flying off in wrong directions at high velocities. The bug was observed on the AUG (rifle shell), but was also present on several other types of shell ejects.• A bunch of hit impact effects have had some of their previous POW restored.• Blood impacts are less randomly angled and more obvious overall now.• Updated tracers speeds.• r_drawtracers_firstperson is now visible and archived and fixed.• Smoke grenade effect now has reduced draw order issues.• Smoke grenade effect no longer has a great disparity between the screen fog effect and the world fog sprites.• Reduced the length of time the particle smoke/dust lasts after an HE grenade explodes.• C4 explosions now have a core explosion that happens right at the bomb itself (so it doesn't look odd when you are spectating or defusing it when it goes off)• Spectators and observers now have a significant reduction in flashbang effect done to them.General Bug Fixes:• Fixed player interrupting another player defusing the bomb by walking in front of them.• Fixed player names running too long in the call vote kick player panel.• Fixed a bug in Arms Race where switching teams put a bot in the Spectator team.• The G3SG1 model now has the safety switch set to 'F'.• The Galil AR model no longer has the light burn on the side plate.• Fixed issue that let the player crouch and slide around with C4.• Fixed the penetration code checking a minimum distance of 2 feet after the first impact for the next impact to happen (this fixes surfaces getting ignored if the first wall penetrated was less than 2 feet think - which is pretty common) -- The material blockbullets_cs now completely blocks bullets regardless of penetration. -- Maximum penetration distance has been reduced from 10.6 feet to 4 feet.• Fixed a bug in Demolition mode where bonus grenade rewards were being called out as achieved but not always given.• Fix for bug where a spectated player with the AUG/SSG zooms in, the spectator sees the muzzle of the weapon.• Fix for z-fighting on Phoenix arms at the wrist on the left side that occurs when carrying the knife and looking directly upwards.• Fixed the radio \"!\" showing up above your own head when you issued a radio command - still shows over other players/bots heads. -- Adjusted color of the overhead \"!\" radio icon to match the HUD scheme.• Restricting 'The Cleaner' and 'Ballistic' achievements to classic mode. Updated description strings to reflect that.• Restricting 'Friendly Firearms' achievement to classic modes.• Restricting 'Base Scamper' to Arms Race mode.• Fixed incorrect Arms Race achievement descriptions.• Fixed a message displaying that you can't plant bomb if you had the C4 selected and used anything (door, etc).• Fixed the C4 button press beeps continuing to play if you started arming the bomb and got killed.• Fixed the bad max value for zoom sensitivity in the options screen.• Removed the custom bind for the Zeus in the options screen.  Moved knife/Zeus bind down with the rest of the specific item binds.• Warmup mode will no longer happen in an offline match now.• The game won’t ignore spectators when deciding to end the Warmup round.• Fixed the Demolition gun progression panel not showing up if you were controlling a bot at the end of the round.  Also fixed the progress displaying incorrectly.• Clicking on the slider bars in the options screens will now change the slider value as expected. • Fixed a button/popup conflict occurring upon selecting \"Restore Defaults\" option.• Fixed the audio reset option not persisting.• Fixed a bug where exiting the video settings screen applies your changes even if you click \"no\".• Fixed a bug where mouse dragging on an option menu slide control resulted in the control being highlighted but not responding to left and right keyboard commands.• Fixed a bug where it was impossible to apply settings changes in options menus using controller.• Fix for first person view weapon not showing up when spectating in Arms Race.• Fix for Safehouse and Shorttrain Map Veteran Medals not working.• Fixed revenge count achievement not progressing in Demolition mode.• Fixed a case where the Arms Race message, \"Alert - You are the new leader\" was displaying in Demolition mode.  • Fix for the Friendly Firearms Achievement being unattainable.  It could not be unlocked if the weapon was not purchased that round.  Now the game tracks the prior team ownership when a weapon is dropped. This enables the game to know if a weapon was ever owned by a given team. This value is now used to determine if and when a kill is made with a weapon that once belonged to the killed player's team.• Fix for friendly fire messages not including the (BOT) prefix.• Arms Race now shows the correct next weapon when you start a new game.• Fixed case where if your vote failed previously, you wouldn’t get the vote button strings on the next vote cast by another player.• Fixed potential bug where some players wouldn't get a voting dialog panel when others cast a vote.• Fixed the Taser range to target indicator where the reticule changing from Green to Red didn’t match the actual range of the Taser.• Fixed losing mouse focus when in the Achievements menu while a map change occurs.• Fixed the Radar line of sight being unaffected by doors.• Fixed the player being unable to see the radar icon for the bomb they dropped if they took over a bot.• When scrambling teams during Demolition Mode gameplay, we now reset the game data when the round restarts.• Fixed third person weapons not animating. • A fix was made to ensure the [E] Takeover Bot navigation hint is not displayed on the spectator menu inappropriately.  It was shown when you changed teams mid round, even though you couldn't actually take over the bot.• Fixed a performance issue caused by changelevel being invoked twice after a change level vote.• Fixed a crash that would allow a server operator to crash clients with bad vote commands.• Fix for the vote UI not sorting to the background when the user opens the buy menu. • Fix for the Call Vote popup disabling the Left and Right arrow keys.• Fix for the Voting UI putting mouse focus back to the game while team select screen is open.• Fix for not being able to vote while the achievements screen is up.• Fix for a scenario where stepping into molotov fire sometimes turns the screen black. Reduced opacity of screen-space smoke effect at the molotov's core from 1.0 to 0.75. -- Also removed some extraneous tings from the molotov explosion and reduced the lifetime on the molotov inferno's embers, which were artificially enlarging the effect's bounding box.• Fix for bound key picking the wrong grenade.• Dropped weapons fly slightly more upwards when thrown from a dead player• Fix for some MVP issues.  The game still disallows controlled bots being the MVP, but players are allowed to be chosen MVP.  This fix displays the player name correctly as well as allowing players to be selected even if they've taken over a bot. -- This also fixes Top Kills being broken when you take over a bot.• Hostages break glass that they touch now. This fixes hostages in cs_office getting stuck trying to run through the big panes of glass sometimes.• Tightened tolerance for CSBots to defuse the bomb. Fixes edge cases where bots think they are close enough to defuse, but are not so they stand there like zombies.• Fixed the ragdoll force being too high.• Fixed the Buy Menu inventory not being populated or correct when you first open the buy menu.• Fixed the preview panel in the Buy Menu not showing preview data (can buy, owned, etc)• Disallowing five achievements in Arms Race because they did not make sense or were too easy to unlock for that game mode.• Fixed a bug where your inventory display wouldn't get updated properly in some cases when you took over a bot.• Fixed a bug where a bot was issuing the wrong radio commands after the new radio code implementation.• The game will no longer show a \"Game Commencing\" message when the game starts.• Fixed a bug where last known nav area could stay permanently NULL due to a bad traceline on displacement terrain. We now trace from the player's WorldSpaceCenter() downwards instead of their GetAbsOrigin() (their feet).• Fixed bug with CNavMesh::GetNavArea() that would return NULL if a nav area was below the ground at all. It now allows for StepHeight (18 unit) tolerance below ground. This was causing CSBots to sometimes go \"zombie\" and stop moving, particularly at spawn at round restart.• The game no longer shows \"Rounds Left\" in the scoreboard when playing Arms Race. • Fixed the game mode label having a \" - \" in the Scoreboard.• Fix for bug in de_train where shooting while strafing + crouching on the green dumpster prop causes unintended behavior.• Fix for errors and warnings console spew in de_inferno.• Fix a race condition in the main menu animation if you enter a submenu and immediately cancel out of it while the main menu is still closing• Fixed case where the earned Achievements in the Win Panel wouldn’t clear their images so if you earned multiple Achievements in one round and only one in the next, the ones you earned in the last round would still show on the panel.• Fixed a memory overrun when a second controller was connected.• Fixed 'One Shot One Kill' awarding based on second bullet kills.• Changed 'Medalist' to award after 100 medals instead of requiring 100% completion.• Fix for a bug where pulling the network cable on your PC while ingame eventually triggers Steam signout, taking you back to the main menu.• Fixed issue where we were displaying the raw map name before transitioning to it when the match ended.  This was also fixed in the vote panel.• Fixed HE Grenade/ molotov not recording kill stats.• Fixed linux DS crash - for pc, we show the raw map name in the chat when we announce the next map just like we used to because we can't assume we know that map name has a localized token.• Fixed logic bug that would not correctly cancel-out splashes when the player was running. • Fix for duplicate game instructor messages displaying when rescuing the hostages.• Fix for target ID over a player displaying default \"target area\" text.• Fixed the thin lines showing on the target IDs before the first time they were filled in.• Changed “War Bonds” Achievement to $50,000 earned.• Fix for bug where user is spectating through the POV of a recently disconnected/quit player, they will be able to see out of world once their character despawns.• Fix for a bug where opening the Scoreboard while in the Choose Team screen shows a camera view of the map floor.• Update to Awards screen to fix confusing flashing awards.• Fixed vote success panels showing bad result data if a vote was cast for the other team only.• Fixed slow orbiting camera movement when using a controller in 3rd person spectator camera view.• Fixed a performance taxing bug where some icons were getting destroyed and recreated each frame if you were a terrorist on a hostage map.• Fix for auto-disconnect message in the HUD going away permanently when the game is paused.• Fix for player being unable to hear knife deployment sounds when deploying the knife while standing on certain properties.• Fix for deploy sound for knife not playing when secondary weapon is dropped.• Fixed a bug where a player would connect late to a dedicated server when the warmup period was already in progress but wouldn't see the warmup panel at the top of the screen. • Fix for voting failing with 6/10 simple majority.• Fix for the Current World Ranking leaderboard mouse over region for individual rows being too large. This caused the incorrect row to be selected while clicking or moving the mouse around the screen.• Fixed bots exclaiming at the start of a round whatever state they were last experiencing when they died or at the end of the previous round.• Fixed a bug where the player was able to switch teams over and over and take control of bots in a game session on a dedicated server.• Fix for a bug where a hostage appeared illuminated on the radar after it was killed.• Fix for incorrect game settings description displayed in loading screen when connecting to a map.• Fix for bug where bot takeover in the middle of a grenade throw results in an extra grenade.• Fixed two edge-case crashes for bot takeover when the bot has no weapons.• Fix for bug where throwing grenades on certain slopes will result in them slowly skittering down the slope rather than coming to rest and exploding.• Fix for a bug that made it possible to throw smoke grenades in such a way that teammates can enter the smoke radius without seeing or hearing the smoke, completely immune to its effect.• Fixed the brightness value slider showing values from highest to lowest.• Fixed SECOND and SECONDS in the \"match is restarting\" alert being hard-coded and not localized.• Reworded the description of \"First Things First\" and \"Target Secured\" Achievements to match what the code expects you to do to achieve it as they were perceived as unawardable.• Fix for scenario in Demolition mode where after killing an opponent the bonus grenade pop up or next gun pop up will block the user's reticle hindering aiming.• Fixed bomb planted instructor hints showing up for a frame and then going away most of the time.• Removed account balance requirement from the “Killanthropist” Achievement criteria.• Fixed new modulated decal art not having enough contrast to make it work with the modulation shader and made a bunch of decals really hard to see.• Fixed cl_spec_mode not saving the player preference so it always reset you to the default spec option.• First person spectator is now the default for all modes.• Fixed throwing weapons landing too short or too high.• Fixed case where if the viewmodel gun barrel traced through a solid object on its way to the impact point, the tracer would interpenetrate that object and make shooting feel off or fake.• Fixed dlight muzzle flash being in the wrong spot (the attachment points on viewmodel never return the proper world position).• Fixed the Scoreboard delay that prevented fast toggling.• Fixed the Scoreboard getting stuck in a toggle state if you weren’t alive.• Fixed the whole screen going blurry when the bomb exploded if you were not killed by that bomb.• Fixed HUD scaling getting stomped by the play distance convars (which aren't used anymore).• Fixed the cl_showloadout convar not getting respected if it wasn't actually toggled in that session.• Flashbangs now make a scorch on the ground to show where it went off.• Dropping the connection to Steam shouldn't drop you to front end on PC/Mac, whether you're in an offline or online game now.• Dedicated server now sends mapgroupname so the client has the proper mapgroupname to send back to DS.• Setting your sound configs to default now sets your speaker option to the optimal setting based on what windows is set to.• Fix for when a player is locked into a controller on pc not being able to use the chat.• Fixed right edge of death message sticking off end of the safe area.• Fixed regression that was preventing Achievements from being announced in the chat channel.• Fix for the background around chat not accommodating very long lines of text.• Fix for CT bots in Lake standing on the kitchen counter, attempting and failing to go through a window.• Fix for bots in Train getting stuck on a ladder.• Fix for bots in Nuke jumping on crates for many seconds.• Fix for the game instructor \"plant bomb\" hint being displayed twice in bombsite B of Train. • Fix for a bug in the Buy Menu where the first time the buy menu is opened, all categories are grey (indicating available) when some items should be red to indicate that they are not affordable at that time.• Removing this convar [ CSGO - sv_allow_lobby_connect_only ]  for CSGO build, since we would like lobbies to always be associated with servers for community matchmaking.• Removed setting of maxplayers before every session.• Disabled maxplayers command, server now sets min/max/default maxplayers based on server.dll• The game now forces extra spectator slots to 2.• Kick a bot that a player is controlling now reverts the player to essentially display as alive. However, their stats still do not change until they are alive again properly• Better logging info when a file fails the sv_pure check.• Added support for the chat to use the same rules for chat visibility as is used for voice audibility.• Disabled mode-based restrictions on showing Elo rank in scoreboard.• Fix for vote UI having incorrect maps listed if the server runs custom map groups.• Fixed some HUD elements not getting scaled properly.• Play With Friends update: -- Hooked up Steam page button. -- Made mouse click get correct IDs for Invite and Join states. -- Made Join states show correctly. -- Removed team play option. -- Fixed the toggle for Private / Public option. -- Fix for the Kick player function. -- Kick now shows the correct ‘kicked’ text string.• Fixed an issue where tracers were coming from the wrong spot when spectating.• Now return correct number of max human players for server browser and master servers.Matchmaking:• Added a convar:mm_session_search_distance which allows us to bump session search distance to be able to find lobbies on Steam Beta (set to >=1).• Fixed the search to not use -1 for numSlots, to not use a filter on numSlots and to not use bypasslobby, but rather use game state filter.• Fixed dedicated server reporting numSlots no greater than 16 even when running PC casual with 20 slots, will still need to do client-side work to not stomp that value.• Fixed a bug where Korean characters could not be typed in chat.• Fixed several bugs with session slots: --  When transitioning from PWF lobby to an official dedicated server we increase members limit to 20. --  Dedicated servers now report numSlots representing max human players• Session created based on information from direct connect to community server will now preserve number of slots defined by the community server.• Fixed a memory leak for searches that produce no results from play with friends.  Message information about no results available only shows for community quick play, otherwise a new game is created without notifying user about it.• Fixed number of slots not getting correctly set when auto creating a new game from an official matchmaking search that didn't return any results.• PWF happens only on official or listen servers.  Play with friends now finds a dedicated server for public game correctly.Community Support• Added a callback into server.dll that can send client messages before engine advances sign on state to connected state. This lets server to pass data to client before client starts loading map and precaching models.• CSGO will send information about viewmodels and player models, max players and maplist down to clients since clients do not necessarily have info about mapgroup and map played by the server.• Community quick play search will no longer attempt to create a new lobby if it fails to find an existing lobby to join.Known issue: - Mini scoreboard occasionally shows the wrong number of players.\t\t\n"
    },
    {
        "id": "1387355123818888452",
        "timestamp": "13 Jun, 2012",
        "link": "http://store.steampowered.com/news/8193/",
        "entry": "\r\n\t\t• Fixed missing bot chatter• Fixed de_dust2_se.kv models• Activated Play with FriendsKnown issues with Play With Friends- Private/public doesn’t seem to do anything.- Invite item is disabled in pause menu but still possible from steam.- Can’t invite players into lobby that aren’t already in the game.  They will load the game but not be in the lobby,  you will need to invite them again.\t\t\n"
    },
    {
        "id": "1389606336007537536",
        "timestamp": "12 Jun, 2012",
        "link": "http://store.steampowered.com/news/8175/",
        "entry": "\r\n\t\tGameplay• Bot difficulty has been adjusted.  They should be a bit easier now.Dedicated Servers:• Added support for overriding values in gamemodes.txt via gamemodes_server.txt - See csgo/gamemodes_server.txt.example for instructions on how to modify it and define your own map groups.• Added support for map sidecar files, which allow mappers to distribute map-specific gamemodes.txt variables in a separate file.  - See csgo/maps/de_dust_se.kv as an example. • Fixed mp_timelimit not working properly when mp_maxrounds was set to 0.UI• net_graph has several changes that will allow players to better see values they (or the server operator) have configured incorrectly.   - The most important difference is that the game tick rate is now shown in the bottom left, which is where “sv:” (server fps) used to be. Server fps is not really a useful metric for players except when it is below the tick rate (indicating the server is overloaded). Server FPS above the tick rate is meaningless.  - The cl_updaterate and cl_cmdrate rate are now labeled as “up:” and “cmd:”, respectively. There is now color coding added to some of the values to indicate out of band values. If cmdrate or updaterate are set above the tick rate (requires a server operator to override the sv_maxcmdrate and sv_maxupdaterate), these values are shown in red. For optimal play experience, these values should match the server tick rate, which is the default behavior unless a server operator has overridden convars.  - Fixed formatting so that the right aligned values are correctly aligned and text doesn’t shift and jump as displayed values change. • A banner element has been added to the Match Scoreboard to better convey Win, Lose, and Draw match results.• Hint text has been added to the bottom of the Loading screen.  • Updated the Armor icon next to the Armor meter to include the Helmet when purchased.• Updated the dominated/dominating/revenge icons for freeze panel, mini-scoreboard, and death notices.• Updates to the Arms Race UI:  - Now when someone reaches the Gold Knife level, the HUD shows a message in the chat text, displays an alert, and plays a sound effect.  - The scoreboard now displays the winner of the Arms Race match.  - The Arms Race weapon progression HUD element in the lower right now properly displays the data for the person you are spectating.  • In Casual and Competitive modes, the weapon inventory in the lower right of the HUD displays the spectated player’s information now.• Voting UI updates:  - Fixed the panel going away right after you cast a vote or saw a vote be cast as a client.  - The vote panel has been made smaller and positioned so it doesn't cover other UI elements.  - After you cast a vote, the game no longer shows the text instructing you to press F1/F2 to vote.  - The Vote to Surrender option has been removed.  Voting to Restart serves the same purpose.   - When an attempt to vote fails because it had already failed recently, the error message is now more descriptive about what's going on.  - If a player casts a vote when another vote is already in progress, they get a message letting them know.  - If there are no players or maps that can be voted on when you try to cast a vote, those categories are disabled in the UI.  - The vote panel now animates.  - Added the proper sounds to the voting events.  - A fix was made to a vote you cast in a single player game automatically failing.  - Fixed the map you are currently playing displaying in the vote UI as \"undefined\".  - Updated the size, look and translucency of the vote panel.  - Added the ability to change the next map in the map list which overrides the next map in the mapgroup.  - Changed the text, \"Restart the map?\" to \"Restart the match?\"  - Voting for the same map you are playing as the next map will extend it and just restart the map instead of loading.  - Fixed voting panel displaying during the freeze cam screenshot.  - Fixed votes for a certain category failing if they had failed previously but had a different subcategory (for example, a vote failed for kicking player A wouldn't let anyone vote to kick player B)• Added a slider to the options menus that allow user to see and edit the numeric value directly.• Removed the Random mapgroup choice from multiplayer Find a Game screen.• Various improvements have been made to the loading screen to improve the layout.• Changed the default bot difficulty option in the Offline with Bots screen to be \"Easy\" instead of \"No Bots\".Maps• Shoots  - Fixed some vphysics console error spew by turning off collision on static props that don't have or don't need collision.• Baggage  - Moved some fill lights out a bit from the wall to reduce highlight intensity.  - Fixed some prop fading glitches.• Dust  - Adjusted the Buy Zone edges to make sure all of the spawn points are completely inside the zones now.  - Set static props with no physics hull to non-solid.• Dust 2  - Added clip brush to a crate at B that fixes an issue with the player getting stuck and dying.  - Fixed the misaligned Humvee windows near CT spawn.• Inferno  - Adjusted the Buy Zone edges to make sure all of the spawn points are completely inside the zones now.  - Fixed some red console spew with static props without physics. • Train  - Fixed a spawn point at T spawn that was intersecting a pillar.• Lake  - Fixed a number of lighting issues.• Office  - Fixed an error message regarding the slide show projection.• Safehouse  - Fixed hard to see into entry way from back porch on the T side.  - The bush prop is now placed against the wall on the T side of the house.    - Fixed a hole that went through to the skybox creating a bright blue spot under the CT side porch next to the stairs.• St Marc  - Removed certain phys props.  - Fixed a number of bad fade distances for cover props.  - Turned some phys props to static props.  - Fixed some bad fades on overlays.  - Fixed z-fighting in fence.• Nuke  - Moved the forklift and added clip brushes to prevent collision issues.  - Added clips to the blue beams in lobby room.• Sugarcane  - Turned a number of phys props to static.  - Deleted certain phys props.  - Fixed a few bad fade distances.Audio• Fix for the ding sound not playing consistently when a new weapon is earned in Arms Race.• Updated the bomb planting sounds.• Updated the helmet hit sounds.• Adjusted hostage pain reaction voice overs.Effects• Some minor optimizations to the explosion effects that may help sorting a little bit.• A few more minor optimizations for the explosions.Bug Fixes• Fixed a bug in initializing a dedicated server. • Fixed a bug with the ‘Expert Marksman’ achievement. • Fixed the ‘Primer’ achievement not awarding properly.• Adjusted the weapon achievements award criteria to more suitable kill counts.• Changed Game Mode based achievement restrictions. All achievements can now be earned in Arms Race game mode and Arms Race-specific achievements are restricted in other game modes.• Fixed ‘Cold War’ achievement only being awarded to the Terrorist team.• Fixed ‘Wild Gooseman’ Chase achievement.• Fixed incorrect description for ‘Street Fighter’ achievement.• Fixed ‘Dead Shepherd’ achievement not getting awarded.• Fix for spectating your killer by default after freezecam/deathcam – camera will now follow a controllable bot first if applicable.• Fixed 'Magic Bullet' achievement.• Felicitous Fun Fact Fixes  - Fixed \"A former player\" shown occasionally.  - Adjusted requirements for many fun facts so they no longer show when inappropriate (e.g. \"most kills with 1 kills\")  - Tweaked parameters in order to provide more interesting funfacts.  - Require team elimination for fun facts mentioning eliminating the enemy team.• Fixed a case where a bot damages a victim and then a player takes over that bot and kills the victim and the death message shows the bot controlling player as the assister and the killer.• Fix for the hitch just before the Gold Knife kill in Arms Race matches.• Removed the display of the crosshair when the C4 is equipped. • Fixed error in grenade throw angle calculation.• Fixed main menu medals disappearing after returning to menu from a game.• Fix for losing mouse cursor after joining a game with Community server browser.• Fixed crashes/errors related to more than 10 players.• Fixed a bug where the taser had no reticule.• Fixed a rare crash in the weapon selection UI.• Fixed some weapons in the UI not showing properly when you were the first player to join a server and it immediately restarted.• Fixed not being able to pick up the C4 if you have a grenade in your inventory.• Fix for the defuse kit icon displaying on the HUD of a T.• Fixed the Warmup panel showing ‘%s1’ at the start of a match.• Fixed medal ranks on the scoreboard not going away in a player slot when that bot or player has left the game.• Fixed the \"next weapon\" element showing if you were spectating at the end of a round in a non-Arms Race match.\t\t\n"
    },
    {
        "id": "1389604433907459787",
        "timestamp": "23 May, 2012",
        "link": "http://store.steampowered.com/news/8042/",
        "entry": "\r\n\t\t• Fixed server crash when total number of player reaches 64• Fixed issue with mouse cursor becoming non-visible after launching a game via the server browser• Fixed UI crashes related to more than 10 players in a game\t\t\n"
    },
    {
        "id": "1389604433879478303",
        "timestamp": "21 May, 2012",
        "link": "http://store.steampowered.com/news/8023/",
        "entry": "\r\n\t\tGameplay:• Updated weapons based on performance metrics: - Slightly increased the damage for the fiveseven to keep it on par with other pistols. - Lowered the max width of the recoil patterns for the MG's to make them better for their price point. - Lowered the spread on the Negev to be more in line with the m249.• Improvements have been made to burst fire and tapping.• Added player spawns to all maps to support up to 30 players.• Player spawns are now randomly selected from a prioritized list of spawn locations in order to better support more players per map.• Adjusted bot behavior to fix the “antline” looking behavior.• Added support for server operators to specify tick rate with the –tickrate parameter.• Physics simulation tick rate now set to be the same as the game tick interval.• Bullet tracers have had improvements made to speed, visual effect, and frequency. • Chickens added to InfernoUI• The Server Browser sorts Favorites and Lan tabs by ping rather than Tags.• The radar will no longer display an ‘X’ for dying players when they are not within sight of the player or player’s teammate.• Weapons with a burst mode will now show which state the gun is in on the ammo panel.• Input device is now locked to whatever device launched the game session.• Updated the Kevlar and Kevlar + Helmet buy menu images.• Updated the Domination icons.Audio• Footsteps update position more often by shifting position determination to client side entity tracking.• Tuned ambient sounds in most maps     Bug Fixes• Fixed a bug with individual pistol round-based achievements.  They can only be earned in Classic game mode now.• Fix for changing video settings while in game sometimes causing a deadlock.• Added a popup message triggered when a player attempts to initiate a vote on a server with voting disable. • Fixed bug where player's nav area would be reported as being on the floor below them causing the radar location to be displayed incorrectly.• Fixed several UI related crash issues.• Third party map and _SE map names no longer display in the scoreboard with the #SFUI_MAP_ localization token.\t\t\n"
    },
    {
        "id": "1513452059992507770",
        "timestamp": "4 May, 2012",
        "link": "http://store.steampowered.com/news/7906/",
        "entry": "\r\n\t\tGameplay:• Added Classic Casual to the Find a Game options.• Increased running inaccuracy of rifles and snipers.  Lowered recoil of negev, lowered standing inaccuracy for negev. improved famas secondary burst grouping, increased ak47 recoil• Added money bonus to knife kills.• Bot difficulty tuned.• Removed the grace period for defusing the bomb as it allows to many hard-to-fix exploits.• Fixed elite cycle time to be the same as CSSUI:• Update to the Main Menu screen: - Rank medals earned by the player will now be displayed underneath their name.• Play menu screen updates: - Updates to win panel for Arms Race including: improvements to displaying the winner, animated elements, and progression icons.• Fixed demo playback loading screen problem.• Fixed placeholder elements on generic loading screen.• Added timer to continue loading screen.• Fixed assists in death messages showing up in modes other than \"Classic\".• Fixed the \"Next Weapon\" panels not displaying properly in Arms Race before you got your first kill.• Fixed alert text popping (position/opacity) behind the Exclamation Point graphic when the animation first comes up when the buy time has expired.• Condensed spectator panel to minimize overlap with other hud elements.• Removed old green tint from radar directional arrow and ring to match current HUD gray color scheme.• Win panel can now show progress made towards stat based achievements completed that round.• Fixed Demolition mode next weapon icons being incorrect.• Added missing outline on incendiary grenade icon.• When using a gamepad, the left and right shoulder button glyphs will gray out when there is no one left to spectate.• Fix for the gun icons being too big and cutoff.Maps:• Added Nuke SE• Added Inferno SE• Dust SE - Added overviews for radar• Aztec SE - Added overviews for radar• Dust - Adjusted size of buy zones for both CT and T's.• Shorttrain - Updated radar overhead map: Removed corner sections, towers, and yellow \"garbage\" can from bomb planting zone.• Train - Increased accuracy of bomb and buy zone graphical indicators on radar image.• Inferno - Updated size and location of buy and spawns zone graphics.• St Marc - Rescaled radar overhead map and angled the bomb zone graphic to match the actual angle of the zone. - Adjusted color-correction settings.• Safehouse - Adjusted color correction settings. - Adjusted radar image scale and position.• Italy - Adjusted buy and spawn zone graphics for CT's and T's. - Fixed extra-large and bright light coronas in hostage area and Wine Cellar. - Fixed a tree at Right Alley - Made a slew of accessible areas inaccessible.  Thank you, Maiho for identifying these. - Adjusted color-correction settings.•\tAztec - Updated buy and spawn zone graphics on radar image.• Dust 2 - Expanded and moved both the CT a T buy and spawn zones in radar image.• Bank - Increased active game area border line weight from 1 to 2 pixels in radar. - Adjusted color-correction settings. - Fixed stretching polygons on the door frame at Gas Station. - Fixed the door model at Market.• Nuke - Adjusted spawn and buy zone graphic indicators on radar image.• Baggage - Readjusted color-correction settings.• Lake - Increased active game area border line weight from 1 to 2 pixels in radar. - Adjusted color correction settings.• Sugarcane - Updated color-correction settings.• Office - Adjusted buy and spawn zone graphics for CT's and T's. - Adjusted color correction settings. - Fixed a bug where the slideshow projection would sometimes show up on the wall behind the projector wall. Audio:• Dsp removed from all third person footsteps and gunshots to increase directionality.  In turn removed audio quality option which was mainly responsible for determining dsp level. • Moved the distance at which weapon shots cross fade to their \"distant\" version further away from the player to aid in identification of weapons being used during the round.• Third person weapon shot volume raised to aid in the identification of weapons being used during the round.Bug Fixes:• Fix for getting the golden knife too early in Arms Race.• Fix for incorrectly retaining the gold knife on respawn after a suicide, team change, or killed by enemy knife.• Regenerate the recoil tables at game mode/type start; this allows the tables to incorporate parameters from loaded convars.• We now remove the golden knife from the player if they had it and lost a level in Arms Race.• Fixed a bug with the HUD where the round timer stops with 0:01 left if the round ends by timeout.• Fix for knife spawning in on the ground with you if you end the round without your secondary weapon (pistol).• Fix for single hostage shooting penalty getting counted multiple times.• Spectators are no longer allowed to vote.• Fixed view model hitching after a full network update.  • Fixed a crash pertaining to death notifications.• Fixed an assert that would happen every time a player opened a prop_dynamic door.• Fixed potential crash in FAMAS and Glock when firing remaining burst shots when the PlayerOwner owner no longer exists. • Fixed flash bangs showing through doors.• Fix for losing mouse focus when directly connecting to a server.• Fix for crash when running a dedicated server under specific linux versions/distrubutions.• Fix for instances of \"Round draw\" voice over playing between matches.• Fixed some ducking pops that would happen when toggling duck during ducking / unducking.Miscellaneous:• First round of mostly PC specific CSM optimizations that improve perf. on all CSM quality levels: - Optimized the core CSM shader to use fewer ALU instructions (VERY_LOW/LOW=21% faster, MEDIUM quality level=10% faster, HIGH=8% faster). - Coaxed the HLSL compiler to [flatten] several important conditionals it was sometimes issuing dynamic jumps for. - The VERY_LOW and LOW quality levels use a single 3D radial lerp vs. the previous 2D+3D lerp - VERY_LOW/LOW only use 2 world cascades vs. the previous 3. At VERY_LOW/LOW quality levels only vertexlit and phong where actually using the closest cascade (for better character self shadowing), so world shadow quality is mostly unaffected by this change. - Also adding a bunch of CSM culling statistics (displayed at the bottom of the screen when cl_csm_debug_2d is 1). - dust2 timedemo avg. FPS results on a NV 6800/Core2 2.4 GHz at VERY_LOW improved by 13% (higher quality settings also see an improvement).\t\t\n"
    },
    {
        "id": "1513451426172810758",
        "timestamp": "27 Apr, 2012",
        "link": "http://store.steampowered.com/news/7854/",
        "entry": "\r\n\t\tRelease notes for 4/27 Beta 12Gameplay:• Fixed an issue in the weapon recoil system which caused tighter shot grouping than intended.• Dead players no longer can see bomb or defuse icons on scoreboard for opposing team members.• Recoil impulses are now more consistent for automatic weapons.• The Movement acceleration and stopspeed values have been lowered per pro feedback.• Slightly increased the variance of the recoil patterns.– Updated the recoil pattern for the ak47.• Adjusted the recoil suppression parameters to help tune burst fire.• Fixed an issue which was causing thrown weapons to emit from the base of players, rather than their hands. Gifted weapons will now correctly throw the proper distance.UI:• Hooked up the win panel for arsenal mode to put emphasis on the winner and runners up.• The next weapon text in AR now displays appropriate text for the mode and state.• Fixed the alert for when you reach gold knife level showing up when anyone reached it.• When you get a point for an assist, it shows in the death message.Maps:• New SE version of Aztec with no fog/particles/debris/ropes (except the bridge)• Dust_SE– Added correct skybox to the map properties.• Shoots– Turned down local-contrast settings.– Fixed a strange clip on stairway.– Fixed lighting on the dark hut in the Middle area.– Fixed a few visual issues with the huts, and thinned out some of the thatch roof.• Dust– Adjusted size of buy zones for both CT and T’s.• Shorttrain– Adjusted local contrast settings on post process controller.– Adjusted tonemap settings.• Inferno– Added smoothing normals to prop bombtanks used in Inferno level.– Fix for incorrect bombsite designation text when standing on the blue truck.• St Marc– Turned down local-contrast settings.– Adjusted bloomscale– Fixed signage typo – changed from “route barée” to “route barrée”• Safehouse– Turned down local-contrast settings.– Adjusted bloomscale– Upped resolution on a prop, removed label that looks blurry.• Italy– Updated some very shiny planters.• Aztec– Fixed floating leaf in tree alpha texture.– Reduced specular on tarp roof.– Fix for objects disappearing from skyline based on camera position near double doors.– Fix for the collision of the crates near bombsite B.– Fixed the collision of the scaffolding at Water below bombsite B.– Improved the texture on the metal bars at Water below T Ramp.– Can no longer climb the scaffolding at bombsite B.– Can no longer walk to the far side of T Ramp.– Can no longer access platform next to Bridge.• Dust 2– Expanded and moved both the CT a T buy and spawn zones in radar image.• Bank– Turned down local-contrast settings.• Baggage– Turned down local-contrast settings.– Adjusted bloomscale• Lake– Turned down local-contrast settings.– Adjusted bloomscale• Sugarcane– Reduced local-contrast settings.– Reduced bloom amount.– Adjusted some tonemap settings.Models:• Fixed clipping issue on Terrorist skin with head wrap.• Fix for Sawed-off where bolt was sticking through the back of the housing during fire and reload animations.Audio:• Trimmed up ambient  content for Nuke, Bank, Train and Sugarcane and made adjustments to the script in Bank (balancing levels and adding some light breeze to match the trees) and a few updated references in Nuke, Train and Sugarcane.• Dust ambient optimization.• Shoots ambient  optimizations• Lake and Safehouse ambient optimizations.• Italy ambient optimizations. Fixed a doorway where a player could move outdoors and still have the indoors ambience.• Baggage ambient revision and optimization.Effects:• Snow effects have been greatly optimized. Snow in Office runs 7x faster than before.Bug Fixes:• Fixed crash when in the Buy menu, then voted yes to change maps.• Fixed noticeable double round start in Arms Race when the first player entered the server/game.• Fixed shadows being cast by vgui screens ( mainly the bomb plant numbers in game ).• Fix for a bug where dropping the Famas in certain points in de_dust would cause the weapon to sink into the ground.Miscellaneous:• Relaxing the supported video card checks:– Display an error and exit if the card doesn’t support shader model 3, bilinear PCF sampling, or cascaded shadow mapping. (No cards are actually marked as not supporting CSM in CS:GO.) So our minimal GPU is now the NVidia 6xxx series (2005), or ATI HD 2xxx (2006) or better.)\t\t\n"
    },
    {
        "id": "1514576755609392269",
        "timestamp": "20 Apr, 2012",
        "link": "http://store.steampowered.com/news/7796/",
        "entry": "\r\n\t\tGameplay:• Reduced the amount of stepwise variation in the weapon recoil patterns so they are smoother and easier to learn and control. • The recoil jump on the xm1014 has been lowered.  • The recoil on the ak47 has been lowered to be more in line with other weapons.  • The ak47 recoil pattern has also been adjusted.• The cash reward for defusing bomb has been raised to $3500.• Added multiple T spawn points to Dust2.UI:• The number of seconds to delay showing the player id when crosshairs are hovered over a player has been increased from 0.1 to 0.5. • Updated the mini-scoreboard for Arms Race to show the weapon for each player.  • All of the players who are in the lead now show what weapon they are leading with in the mini-scoreboard.• The “YOU ARE ON TEAM” and old weapon leader messages have been removed.• Added a weapon progression panel in Demolition mode that shows the full array of weapons and your current progress.• Scoreboard will now instantly appear when triggered.  • Easier to see who is alive by darkening the dead players.• Updated weapon icons.• Updated AUG small icon. • Updated MAG7 small icon.• Removed suppressor and extended stock from MP7 outline icon.• Added extended stock to MP9 outline icon.Maps:• Shoots - Adjusted fog settings. - Adjusted light_environment settings. - Adjusted local contrast settings (turned off blur effect). - Adjusted bloom scale (turned down effect). - Raised light levels. - Adjusted fade distance on bicycle. - Adjusted fade distance on light/glow.  - Readjusted some wood textures. - Fixed some mismatched wood textures on steps. - Added missing faces on wood planks. - Adjusted fade distance on poster inside hut. - Adjusted fade distance on rice basket in huts. - Adjusted texture and position of wood railing model. - Added player clips to sniper shack to prevent players from getting stuck.• Dust - Added some back faces to the geometry where players could see out of the map. - Fix for an environment light effect that could be seen through a building as well as smoke grenade effect. - Added a cubemap and updated a floor material for a noticeably dark door.• Office - Adjusted position of boxes so player can run past easily. - Updated the counter prop objects to be prop_physics_multiplayer, and marked as debris. - Turned off collision on pipes and lamp at Backway stairwell to prevent camping there. - Adjusted light map resolution just inside the stairwell to help it blend better. - Removed garbage models that were causing collision issues. - Added additional light behind CT Spawn so the lighting will look more consistent on the player models. - Removed half submerged pop cans from desk at entrance stairwell. - Made all of the monitors and keyboards physics objects. - Fixed missing trim at the main entrance stairwell ceiling. - Added player clip brushes to windows at Snipers Nest to make jumping through them easier. - Set the objects without physics hulls to non solid. - Adjusted the fade distance on the trash can near the building entrance at the back courtyard, as well as a number of others that were popping into view. - Adjusting local-contrast settings (made less blurry) - Tuned tonemap controller values to be more consistent with other levels.• Inferno - Fix for players getting out of the map at T spawn.• Safehouse - Fix for being able to jump on fence on edge of map. - Fix for missing faces by bathtub.• Italy - Turned down local_contrast setting.• Aztec - Updated the helicopter animation. - Fixed a bug with particles not reliably turning off.• Bank - Replaced skybox trees models with simple cards. - Disabled CSM on foliage and chain-link fence. - Adjusted fog settings to match more closely to other maps.• Nuke - Reduced bloom scale.• Sugarcane - Tuned fog and prop fades. - Deleted a vista props outside of player space.\t\t\n"
    },
    {
        "id": "1514576159317050030",
        "timestamp": "13 Apr, 2012",
        "link": "http://store.steampowered.com/news/7738/",
        "entry": "\r\n\t\tMaps:• Added Demolition maps:• Sugarcane• Safehouse• Bank• Short Train• Quickmatch now connects to Demolition map cycle group.• Find A Game allows you to join an online game of a specific type.  This update offers Arsenal Demolition, Arms Race, and Classic Competitive game modes.  The map cycle groups include: - All Classic Maps - Arms Race Maps - Demolition Maps• De_nuke - Fixed bot nav behavior outside locker room and near bombsite A.• Cs_office - Fixed hostage bots getting stuck behind the couch. - Fixed bots getting stuck on the roof of the dumpster.• Cs_italy - Fixed vines penetrating door frame at T Start. - Fixed building floating in skybox at Balcony. - Fixed missing geometry in arches and wall in Market. - Fixed curved pipe and square wall edge creating black area at Left Alley. - Fixed a gap in the floor at Left Alley. - Fixed texture mismatch at Market. - Fixed unnecessary collision on curb at CT Spawn Zone. - Fixed being able to see out of the playable map at Market. - Fixed not being able to jump while standing on potted plant at CT Start. - Fixed small gap in street at Left Alley. - Fixed brightly lit area at window near hostage room and T Start.Gameplay:• Added additional camera punch effect to weapon firing to give more visual feedback.• Added convar to support buying two flashbangs (ammo_grenade_limit_flashbang).  This is disabled by default.• SMGs get a range increase.• Falloff distances for SMGs have been improved to reduce micro hits at medium distances.• UMP 45 gets a small armor ratio buff and a very minor cycle time buff.• P90 gets a armor ratio debuff to bring it more in line with its smg brethren rather than make it as good if not better than entry level rifles.• Added first shot recoil suppression to allow for closer grouping of the first few shots in a burst or full auto fire.• TBots that try to plant in an invalid space will quickly give up and pick a new place to try to plant now.• Arms Race now ends with a gold knife to convey to the user the difference between killing someone with a knife to steal their level and killing someone with a knife to win the game.• A knife kill in Arms Race now only sets you back a weapon level if you were killed by an enemy.• The C4 now has a short (0.5 second) grace period for defusing, during which time the player can interrupt and resume defusing. This restores the old 0.5 second latency that existing in CS for defusing, but also maintains the newer preferred ability to stop defusing without the player being inexplicably stuck for up to 0.5 seconds. This also greatly reduces the chance that small lag/packet loss events will result in the defuse being interrupted.• Reduced the size of the hostage hitboxes.• Changed the ducking speed to match the unducking speed. Both are now 200 ms.• Slightly reduced HE grenade damage per pro feedback.• Reduced per shot weapon inaccuracy across all weapons.UI• Added server browser to Play menu.• Arms Race UI improvements - Added more elements to the next weapon panels that fill out and animate into place when you are awarded your next weapon - this convey  the weapon progression better.• Fixed an issue where observers didn't see updated ammo counts for the player they were observing.• Fixed the issue in which the ammo animated when changing the observed target and the new target had different clip/ammo counts.• Added Elo rank to the stats screen.• Updated Elo rank icons.• Video settings - Changed vsync option so it does not get immediately applied when the option is changed by the user in the UI.  Instead, the user must hit the Apply button for the vsync setting to be changed, like most of the other settings.• Video settings - the \"Reset to Defaults\" disables vsync now.• Added missing motion blur option to the Advanced Video Settings menu.  The Advanced Video options have been reorganized: global shadow quality is now at the top, and the two anti-aliasing settings have been moved together.• The team select screen now has a short objectives blurb so as a new player you know what the map objectives are.• Updated color of bomb holder, bomb planted and defuse kit icons to match gold, red and blue used elsewhere in the hud.• Updated defuse kit image for buy menu.• Updated several weapon icons.• Updated death notification icons.• Added a T knife icon.• Updated mapgroup thumbnails.• Added new achievement icons.• Updated the radio command panel.• Updated radar minimaps: - Office - Aztec - Lake - Dust - Dust 2 - St Marc - NukeAudio• Fixed bug that was stopping hostage music abruptly.• Moved kill music stingers from client to server, are more audible, and have been added to demolition mode.• Dominating music stinger now plays for \"still dominating\" as well.• Added ‘hostages near to rescue’ music cues.• Fixed weapon foley being heard at unrealistic distances (player distance misrepresented)• Updated weapon shots:   - ak47 - deagle  - famas  - g3sg1  - m249  - m4a1  - mag7  - mp7 - negev  - nova - vscar20 - sg556 - ump45  - awp - ssg08 - sawed off  - xm1014  - novaEffects:• Disabled blob shadows.Bug Fixes• Fixed a bug where tracers were not originating from the barrel on machine guns.• Fixed ragdoll bodies twitching postmortem.• Fixed getting stuck in another player when joining spectator team at halftime in competitive mode.• Fixed missing reload animations and recoil for certain picked up weapons.  • Fixed scenario where “Counter-terrorists Win\" voice over announcement does not play at round end if the \"bomb has been defused\" voice over is played. • Fixed callvote UI taking mouse focus and breaking the Buy Menu. • Fixed so Tased player models don't bleed out.• Fixed \"Input Device not found\" on PC direct connect games.  It now uses platform defaults in the case where an input device is not set before determining bot difficulty. • Removed servers calling votes at the end of a match.• Elo improvements - fixed a bug initializing Elo for users who got initialized by direct connect instead of via matchmaking.• Fixed Terrorists receiving defuse kits.  • Fixed an issue where damaged was being sent across the network as a byte. This allowed the AWP and bomb explosions to both result in > 255 damage.• Fixed bug where a game announced ‘match point’ and ended match prematurely.\t\t\n"
    },
    {
        "id": "1515700145076571169",
        "timestamp": "30 Mar, 2012",
        "link": "http://store.steampowered.com/news/7689/",
        "entry": "\r\n\t\t- Fixed an issue which would cause the radio command menu to appear inappropriately- Increased armor penetration of HE Grenades- mp_c4timer and fps_max convars are now exposed\t\t\n"
    },
    {
        "id": "1443641916898851208",
        "timestamp": "16 Mar, 2012",
        "link": "http://store.steampowered.com/news/7552/",
        "entry": "\r\n\t\tMaps:• Added St. Marc to Demolition mode.• Added and set quick match to cs_Italy• Added de_dust2_se. See blog for details.Gameplay:• New weapons: Famas, Galil AR, P250, Dual Berettas• Demolition mode update• Match now consists of two 10 round halves• Weapon progression updated: - CTs: m4a4, p90, ump45, deagle, nova, fiveseven, hkp2000, ssg08, awp, awp - Ts: ak47, p90, bison, deagle, nova, tec9, glock, ssg08, awp, awpUI• Added My Awards – Achievements & Stats• Updated alerts animation• Games with a half-time now display that it’s the last round before halftime• Fixed final round not being called out in games with two halves• Fixed player getting a weapon upgrade on the last round before half-time/teamswap• Fixed some bugs where involving bot takeover scenarios• Fixed death message icon order - not penetration icon show up before the headshot so it makes sense in chronological order• Fixed some bad defusing text when spectating• Fixed \"YOU ARE ON TEAM\" panels not fading out properly• Fixed same panels not toggling visibility properly when toggling the scoreboard• When a CT is defusing, his ID shows the defuse icon now• Fixed scoreboard not showing from team selection menu• Restored ability to see when you unlocked an achievement on PC• Along with the hint, weapons now click when you change modes• Fix to not display the cash award message in the following cases:• The round just prior to halftime has ended.• It is not currently halftime • It is not the last round of the match (including the clinch victory early situation)• Space bar now changes camera mode and navigation text has been updated accordingly• Update to Match Set Up screen• Fix for PC video settings defaulting to COUCH• Modified \"Playing on Team...\" panel.• Visual update to mini-scoreboardMaps• Dust   - Fix bug that allowed player to hop near wall and see into inaccessible area - replaced some nodraw brushes with textures to help fix these holes. - Fixed bug where player clip limits jumping  -removed player clip that was preventing them from jumping the full height.• Dust 2 - Fixed bug where player can toss bomb out of reach. - Fixed bug where clip preventing jumping.  - Fixed bug where player was able to see out of map. -added some simple tops to this geometry. - Fixed bug where player can hop near wall and see into inaccessible area. - Fixed bug where clip limits jumping. • Lake  - Tree models were optimized - Fixed bug where player gets stuck on the physics prop model of lumber, changed this to static props - Increased the fade distance at which some of the bushes fade - Nav fixes - Fixed being able to get stuck between rock & shed.  - Adjusted start position of the upstairs doors into the bedroom and bathroom so there is better flow into those spaces. - Adjusted some tree cards in the skybox, and perimeter. - Pulled out a couple unneeded tree models in the 3dskybox to help with perf. - Draw distance for the floaties in the water seems too near. • Train  - Adjusted fog per community feedback. - Inferno - Tightened up collision volumes for Inferno Objects bomb crate, bomb crate stack, and bomb tanksAudio• Disabled unused sound entries.  Adding back in two sets of bullet surface impacts.• Added semi-auto to auto switch sound • Ambient sound adjustments for dust, dust2, and Italy • Sound effects tuning • Pulled down volume of ammo pickup that's played at round start. • Pulled bell attenuation back to normal levels, only hear in and around terrorist spawn, no longer level wide.• Increased life on helicopter from 15 to 25 seconds, for chopper fade out.• UI timer click down to .35 volumeEffects• Grenade visibility - added self illum to colored stripe on thrown flashbang.• Tune effect for the C4's flashing indicator light.Animations• Removed forearm slap, times and remixed clip out wave• Tune Terrorist run - Work on the arms and weapon. • Fix crouch fire leg wiggle in Terrorist aim• Fix for crouchwalk finger popping, found that stand had a sliding finger, now stabilized in Terrorist aimOther Bug Fixes• Fix for spawning inside another player after halftime. • Fixing CSM entity related bug that could cause CSM shadows to be disabled when toggling between fullscreen and windowed when connected to a dedicated server. • Fixing red console errors with props that were set to use VPhysics, but have no collision hull. • Fixed bug where the main menu could be clicked through the custom game menu (resulting in both being drawn)• Cleaned up warnings in single player screen\t\t\n"
    }
]